[NoCoverage] BlockStatement
src/application/services/candidateService.ts:9:9
 import { Application } from '../../domain/models/Application';
 
 export const addCandidate = async (candidateData: any) => {
-    try {
-        validateCandidateData(candidateData); // Validar los datos del candidato
-    } catch (error: any) {
+    try {} catch (error: any) {
         throw new Error(error);
     }

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:11:26
 export const addCandidate = async (candidateData: any) => {
     try {
         validateCandidateData(candidateData); // Validar los datos del candidato
-    } catch (error: any) {
-        throw new Error(error);
-    }
+    } catch (error: any) {}
 
     const candidate = new Candidate(candidateData); // Crear una instancia del modelo Candidate

[NoCoverage] ConditionalExpression
src/application/services/candidateService.ts:21:13
         const candidateId = savedCandidate.id; // Obtener el ID del candidato guardado
 
         // Guardar la educación del candidato
-        if (candidateData.educations) {
+        if (false) {
             for (const education of candidateData.educations) {
                 const educationModel = new Education(education);

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:21:39
         const candidateId = savedCandidate.id; // Obtener el ID del candidato guardado
 
         // Guardar la educación del candidato
-        if (candidateData.educations) {
-            for (const education of candidateData.educations) {
-                const educationModel = new Education(education);
-                educationModel.candidateId = candidateId;
-                await educationModel.save();
-                candidate.educations.push(educationModel);
-            }
-        }
+        if (candidateData.educations) {}
 
         // Guardar la experiencia laboral del candidato

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:22:63
 
         // Guardar la educación del candidato
         if (candidateData.educations) {
-            for (const education of candidateData.educations) {
-                const educationModel = new Education(education);
-                educationModel.candidateId = candidateId;
-                await educationModel.save();
-                candidate.educations.push(educationModel);
-            }
+            for (const education of candidateData.educations) {}
         }
 

[NoCoverage] ConditionalExpression
src/application/services/candidateService.ts:31:13
         }
 
         // Guardar la experiencia laboral del candidato
-        if (candidateData.workExperiences) {
+        if (false) {
             for (const experience of candidateData.workExperiences) {
                 const experienceModel = new WorkExperience(experience);

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:31:44
         }
 
         // Guardar la experiencia laboral del candidato
-        if (candidateData.workExperiences) {
-            for (const experience of candidateData.workExperiences) {
-                const experienceModel = new WorkExperience(experience);
-                experienceModel.candidateId = candidateId;
-                await experienceModel.save();
-                candidate.workExperiences.push(experienceModel);
-            }
-        }
+        if (candidateData.workExperiences) {}
 
         // Guardar los archivos de CV

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:32:69
 
         // Guardar la experiencia laboral del candidato
         if (candidateData.workExperiences) {
-            for (const experience of candidateData.workExperiences) {
-                const experienceModel = new WorkExperience(experience);
-                experienceModel.candidateId = candidateId;
-                await experienceModel.save();
-                candidate.workExperiences.push(experienceModel);
-            }
+            for (const experience of candidateData.workExperiences) {}
         }
 

[NoCoverage] EqualityOperator
src/application/services/candidateService.ts:41:33
         }
 
         // Guardar los archivos de CV
-        if (candidateData.cv && Object.keys(candidateData.cv).length > 0) {
+        if (candidateData.cv && Object.keys(candidateData.cv).length >= 0) {
             const resumeModel = new Resume(candidateData.cv);
             resumeModel.candidateId = candidateId;

[NoCoverage] LogicalOperator
src/application/services/candidateService.ts:41:13
         }
 
         // Guardar los archivos de CV
-        if (candidateData.cv && Object.keys(candidateData.cv).length > 0) {
+        if (candidateData.cv || Object.keys(candidateData.cv).length > 0) {
             const resumeModel = new Resume(candidateData.cv);
             resumeModel.candidateId = candidateId;

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:48:26
             candidate.resumes.push(resumeModel);
         }
         return savedCandidate;
-    } catch (error: any) {
-        if (error.code === 'P2002') {
-            // Unique constraint failed on the fields: (`email`)
-            throw new Error('The email already exists in the database');
-        } else {
-            throw error;
-        }
-    }
+    } catch (error: any) {}
 };
 

[NoCoverage] EqualityOperator
src/application/services/candidateService.ts:49:13
         }
         return savedCandidate;
     } catch (error: any) {
-        if (error.code === 'P2002') {
+        if (error.code !== 'P2002') {
             // Unique constraint failed on the fields: (`email`)
             throw new Error('The email already exists in the database');

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:49:37
         }
         return savedCandidate;
     } catch (error: any) {
-        if (error.code === 'P2002') {
-            // Unique constraint failed on the fields: (`email`)
-            throw new Error('The email already exists in the database');
-        } else {
+        if (error.code === 'P2002') {} else {
             throw error;
         }

[NoCoverage] StringLiteral
src/application/services/candidateService.ts:51:29
     } catch (error: any) {
         if (error.code === 'P2002') {
             // Unique constraint failed on the fields: (`email`)
-            throw new Error('The email already exists in the database');
+            throw new Error("");
         } else {
             throw error;

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:52:16
         if (error.code === 'P2002') {
             // Unique constraint failed on the fields: (`email`)
             throw new Error('The email already exists in the database');
-        } else {
-            throw error;
-        }
+        } else {}
     }
 };

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:58:83
     }
 };
 
-export const findCandidateById = async (id: number): Promise<Candidate | null> => {
-    try {
-        const candidate = await Candidate.findOne(id); // Cambio aquí: pasar directamente el id
-        return candidate;
-    } catch (error) {
-        console.error('Error al buscar el candidato:', error);
-        throw new Error('Error al recuperar el candidato');
-    }
-};
+export const findCandidateById = async (id: number): Promise<Candidate | null> => {};
 
 export const updateCandidateStage = async (id: number, applicationIdNumber: number, currentInterviewStep: number) => {

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:59:9
 };
 
 export const findCandidateById = async (id: number): Promise<Candidate | null> => {
-    try {
-        const candidate = await Candidate.findOne(id); // Cambio aquí: pasar directamente el id
-        return candidate;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error al buscar el candidato:', error);
         throw new Error('Error al recuperar el candidato');

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:62:21
     try {
         const candidate = await Candidate.findOne(id); // Cambio aquí: pasar directamente el id
         return candidate;
-    } catch (error) {
-        console.error('Error al buscar el candidato:', error);
-        throw new Error('Error al recuperar el candidato');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
src/application/services/candidateService.ts:64:25
         return candidate;
     } catch (error) {
         console.error('Error al buscar el candidato:', error);
-        throw new Error('Error al recuperar el candidato');
+        throw new Error("");
     }
 };

[Killed] BlockStatement
src/application/services/candidateService.ts:68:118
     }
 };
 
-export const updateCandidateStage = async (id: number, applicationIdNumber: number, currentInterviewStep: number) => {
-    try {
-        const application = await Application.findOneByPositionCandidateId(applicationIdNumber, id);
-        if (!application) {
-            throw new Error('Application not found');
-        }
-
-        // Actualizar solo la etapa de la entrevista actual de la aplicación específica
-        application.currentInterviewStep = currentInterviewStep;
-
-        // Guardar la aplicación actualizada
-        await application.save();
-
-        return application;
-    } catch (error: any) {
-        throw new Error(error);
-    }
-};
+export const updateCandidateStage = async (id: number, applicationIdNumber: number, currentInterviewStep: number) => {};
killedBy: updateCandidateStage should update the candidate stage and return the updated application
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"applicationDate": 2026-05-06T01:33:01.202Z, "candidateId": 1, "currentInterviewStep": 2, "id": 1, "notes": null, "positionId": 1}
Received: undefined

[Killed] BlockStatement
src/application/services/candidateService.ts:69:9
 };
 
 export const updateCandidateStage = async (id: number, applicationIdNumber: number, currentInterviewStep: number) => {
-    try {
-        const application = await Application.findOneByPositionCandidateId(applicationIdNumber, id);
-        if (!application) {
-            throw new Error('Application not found');
-        }
-
-        // Actualizar solo la etapa de la entrevista actual de la aplicación específica
-        application.currentInterviewStep = currentInterviewStep;
-
-        // Guardar la aplicación actualizada
-        await application.save();
-
-        return application;
-    } catch (error: any) {
+    try {} catch (error: any) {
         throw new Error(error);
     }
killedBy: updateCandidateStage should update the candidate stage and return the updated application
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ObjectContaining {"applicationDate": 2026-05-06T01:33:01.018Z, "candidateId": 1, "currentInterviewStep": 2, "id": 1, "notes": null, "positionId": 1}
Received: undefined

[Killed] BooleanLiteral
src/application/services/candidateService.ts:71:13
 export const updateCandidateStage = async (id: number, applicationIdNumber: number, currentInterviewStep: number) => {
     try {
         const application = await Application.findOneByPositionCandidateId(applicationIdNumber, id);
-        if (!application) {
+        if (application) {
             throw new Error('Application not found');
         }
killedBy: updateCandidateStage should update the candidate stage and return the updated application
statusReason: Error: Error: Application not found

[Killed] ConditionalExpression
src/application/services/candidateService.ts:71:13
 export const updateCandidateStage = async (id: number, applicationIdNumber: number, currentInterviewStep: number) => {
     try {
         const application = await Application.findOneByPositionCandidateId(applicationIdNumber, id);
-        if (!application) {
+        if (true) {
             throw new Error('Application not found');
         }
killedBy: updateCandidateStage should update the candidate stage and return the updated application
statusReason: Error: Error: Application not found

[NoCoverage] StringLiteral
src/application/services/candidateService.ts:72:29
     try {
         const application = await Application.findOneByPositionCandidateId(applicationIdNumber, id);
         if (!application) {
-            throw new Error('Application not found');
+            throw new Error("");
         }
 

[NoCoverage] BlockStatement
src/application/services/candidateService.ts:82:26
         await application.save();
 
         return application;
-    } catch (error: any) {
-        throw new Error(error);
-    }
+    } catch (error: any) {}
 };
