[NoCoverage] BlockStatement
src/application/services/fileUploadService.ts:5:43
 import { Request, Response } from 'express';
 
 const storage = multer.diskStorage({
-    destination: function (req, file, cb) {
-        cb(null, '../uploads/');
-    },
+    destination: function (req, file, cb) {},
     filename: function (req, file, cb) {
         const uniqueSuffix = Date.now();

[NoCoverage] StringLiteral
src/application/services/fileUploadService.ts:6:18
 
 const storage = multer.diskStorage({
     destination: function (req, file, cb) {
-        cb(null, '../uploads/');
+        cb(null, "");
     },
     filename: function (req, file, cb) {

[NoCoverage] BlockStatement
src/application/services/fileUploadService.ts:8:40
     destination: function (req, file, cb) {
         cb(null, '../uploads/');
     },
-    filename: function (req, file, cb) {
-        const uniqueSuffix = Date.now();
-        cb(null, uniqueSuffix + '-' + file.originalname);
-    }
+    filename: function (req, file, cb) {}
 });
 

[NoCoverage] BlockStatement
src/application/services/fileUploadService.ts:14:96
     }
 });
 
-const fileFilter = (req: Request, file: Express.Multer.File, cb: multer.FileFilterCallback) => {
-    if (file.mimetype === 'application/pdf' || file.mimetype === 'application/vnd.openxmlformats-officedocument.wordprocessingml.document') {
-        cb(null, true);
-    } else {
-        cb(null, false);
-    }
-};
+const fileFilter = (req: Request, file: Express.Multer.File, cb: multer.FileFilterCallback) => {};
 
 const upload = multer({

[NoCoverage] LogicalOperator
src/application/services/fileUploadService.ts:15:9
 });
 
 const fileFilter = (req: Request, file: Express.Multer.File, cb: multer.FileFilterCallback) => {
-    if (file.mimetype === 'application/pdf' || file.mimetype === 'application/vnd.openxmlformats-officedocument.wordprocessingml.document') {
+    if (file.mimetype === 'application/pdf' && file.mimetype === 'application/vnd.openxmlformats-officedocument.wordprocessingml.document') {
         cb(null, true);
     } else {

[NoCoverage] ConditionalExpression
src/application/services/fileUploadService.ts:15:9
 });
 
 const fileFilter = (req: Request, file: Express.Multer.File, cb: multer.FileFilterCallback) => {
-    if (file.mimetype === 'application/pdf' || file.mimetype === 'application/vnd.openxmlformats-officedocument.wordprocessingml.document') {
+    if (false) {
         cb(null, true);
     } else {

[NoCoverage] BooleanLiteral
src/application/services/fileUploadService.ts:16:18
 
 const fileFilter = (req: Request, file: Express.Multer.File, cb: multer.FileFilterCallback) => {
     if (file.mimetype === 'application/pdf' || file.mimetype === 'application/vnd.openxmlformats-officedocument.wordprocessingml.document') {
-        cb(null, true);
+        cb(null, false);
     } else {
         cb(null, false);

[NoCoverage] BlockStatement
src/application/services/fileUploadService.ts:17:12
 const fileFilter = (req: Request, file: Express.Multer.File, cb: multer.FileFilterCallback) => {
     if (file.mimetype === 'application/pdf' || file.mimetype === 'application/vnd.openxmlformats-officedocument.wordprocessingml.document') {
         cb(null, true);
-    } else {
-        cb(null, false);
-    }
+    } else {}
 };
 

[NoCoverage] BooleanLiteral
src/application/services/fileUploadService.ts:18:18
     if (file.mimetype === 'application/pdf' || file.mimetype === 'application/vnd.openxmlformats-officedocument.wordprocessingml.document') {
         cb(null, true);
     } else {
-        cb(null, false);
+        cb(null, true);
     }
 };

[NoCoverage] ArithmeticOperator
src/application/services/fileUploadService.ts:25:19
 const upload = multer({
     storage: storage,
     limits: {
-        fileSize: 1024 * 1024 * 10 // 10MB
+        fileSize: 1024 / 1024 * 10 // 10MB
     },
     fileFilter: fileFilter

[NoCoverage] ArithmeticOperator
src/application/services/fileUploadService.ts:25:19
 const upload = multer({
     storage: storage,
     limits: {
-        fileSize: 1024 * 1024 * 10 // 10MB
+        fileSize: 1024 * 1024 / 10 // 10MB
     },
     fileFilter: fileFilter

[NoCoverage] BlockStatement
src/application/services/fileUploadService.ts:30:60
     fileFilter: fileFilter
 });
 
-export const uploadFile = (req: Request, res: Response) => {
-    const uploader = upload.single('file');
-    uploader(req, res, function (err) {
-        if (err instanceof multer.MulterError) {
-            // Manejo de errores específicos de Multer
-            return res.status(500).json({ error: err.message });
-        } else if (err) {
-            // Otros errores posibles
-            return res.status(500).json({ error: err.message });
-        }
-
-        // Verificar si el archivo fue rechazado por el filtro de archivos
-        if (!req.file) {
-            return res.status(400).json({ error: 'Invalid file type, only PDF and DOCX are allowed!' });
-        }
-        // Si todo está bien, proceder a responder con la ruta del archivo y el tipo de archivo
-        res.status(200).json({
-            filePath: req.file.path,
-            fileType: req.file.mimetype  // Aquí se añade el tipo de archivo
-        });
-    });
-};
+export const uploadFile = (req: Request, res: Response) => {};

[NoCoverage] BlockStatement
src/application/services/fileUploadService.ts:32:39
 
 export const uploadFile = (req: Request, res: Response) => {
     const uploader = upload.single('file');
-    uploader(req, res, function (err) {
-        if (err instanceof multer.MulterError) {
-            // Manejo de errores específicos de Multer
-            return res.status(500).json({ error: err.message });
-        } else if (err) {
-            // Otros errores posibles
-            return res.status(500).json({ error: err.message });
-        }
-
-        // Verificar si el archivo fue rechazado por el filtro de archivos
-        if (!req.file) {
-            return res.status(400).json({ error: 'Invalid file type, only PDF and DOCX are allowed!' });
-        }
-        // Si todo está bien, proceder a responder con la ruta del archivo y el tipo de archivo
-        res.status(200).json({
-            filePath: req.file.path,
-            fileType: req.file.mimetype  // Aquí se añade el tipo de archivo
-        });
-    });
+    uploader(req, res, function (err) {});
 };

[NoCoverage] ConditionalExpression
src/application/services/fileUploadService.ts:33:13
 export const uploadFile = (req: Request, res: Response) => {
     const uploader = upload.single('file');
     uploader(req, res, function (err) {
-        if (err instanceof multer.MulterError) {
+        if (true) {
             // Manejo de errores específicos de Multer
             return res.status(500).json({ error: err.message });

[NoCoverage] ConditionalExpression
src/application/services/fileUploadService.ts:33:13
 export const uploadFile = (req: Request, res: Response) => {
     const uploader = upload.single('file');
     uploader(req, res, function (err) {
-        if (err instanceof multer.MulterError) {
+        if (false) {
             // Manejo de errores específicos de Multer
             return res.status(500).json({ error: err.message });

[NoCoverage] BlockStatement
src/application/services/fileUploadService.ts:36:25
         if (err instanceof multer.MulterError) {
             // Manejo de errores específicos de Multer
             return res.status(500).json({ error: err.message });
-        } else if (err) {
-            // Otros errores posibles
-            return res.status(500).json({ error: err.message });
-        }
+        } else if (err) {}
 
         // Verificar si el archivo fue rechazado por el filtro de archivos

[NoCoverage] ConditionalExpression
src/application/services/fileUploadService.ts:36:20
         if (err instanceof multer.MulterError) {
             // Manejo de errores específicos de Multer
             return res.status(500).json({ error: err.message });
-        } else if (err) {
+        } else if (false) {
             // Otros errores posibles
             return res.status(500).json({ error: err.message });

[NoCoverage] ConditionalExpression
src/application/services/fileUploadService.ts:42:13
         }
 
         // Verificar si el archivo fue rechazado por el filtro de archivos
-        if (!req.file) {
+        if (false) {
             return res.status(400).json({ error: 'Invalid file type, only PDF and DOCX are allowed!' });
         }

[NoCoverage] BooleanLiteral
src/application/services/fileUploadService.ts:42:13
         }
 
         // Verificar si el archivo fue rechazado por el filtro de archivos
-        if (!req.file) {
+        if (req.file) {
             return res.status(400).json({ error: 'Invalid file type, only PDF and DOCX are allowed!' });
         }

[NoCoverage] ObjectLiteral
src/application/services/fileUploadService.ts:43:41
 
         // Verificar si el archivo fue rechazado por el filtro de archivos
         if (!req.file) {
-            return res.status(400).json({ error: 'Invalid file type, only PDF and DOCX are allowed!' });
+            return res.status(400).json({});
         }
         // Si todo está bien, proceder a responder con la ruta del archivo y el tipo de archivo
