[Killed] BlockStatement
src/application/services/interviewAdvanceService.ts:18:28
 export const findNextInterviewStep = (
     steps: InterviewStep[],
     currentStepId: number,
-): InterviewStep | null => {
-    const sorted = [...steps].sort((a, b) => a.orderIndex - b.orderIndex);
-    const currentIndex = sorted.findIndex((s) => s.id === currentStepId);
-
-    if (currentIndex === -1) {
-        throw new Error('Current interview step does not belong to this interview flow');
-    }
-
-    if (currentIndex === sorted.length - 1) {
-        return null;
-    }
-
-    return sorted[currentIndex + 1];
-};
+): InterviewStep | null => {};
 
 const findApplicationForCandidate = async (applicationId: number, candidateId: number) => {
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Candidate is already in the last interview step

[Survived] ArithmeticOperator
src/application/services/interviewAdvanceService.ts:19:46
     steps: InterviewStep[],
     currentStepId: number,
 ): InterviewStep | null => {
-    const sorted = [...steps].sort((a, b) => a.orderIndex - b.orderIndex);
+    const sorted = [...steps].sort((a, b) => a.orderIndex + b.orderIndex);
     const currentIndex = sorted.findIndex((s) => s.id === currentStepId);
 

[Survived] ArrowFunction
src/application/services/interviewAdvanceService.ts:19:36
     steps: InterviewStep[],
     currentStepId: number,
 ): InterviewStep | null => {
-    const sorted = [...steps].sort((a, b) => a.orderIndex - b.orderIndex);
+    const sorted = [...steps].sort(() => undefined);
     const currentIndex = sorted.findIndex((s) => s.id === currentStepId);
 

[Killed] ConditionalExpression
src/application/services/interviewAdvanceService.ts:20:50
     currentStepId: number,
 ): InterviewStep | null => {
     const sorted = [...steps].sort((a, b) => a.orderIndex - b.orderIndex);
-    const currentIndex = sorted.findIndex((s) => s.id === currentStepId);
+    const currentIndex = sorted.findIndex((s) => false);
 
     if (currentIndex === -1) {
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Current interview step does not belong to this interview flow

[Killed] EqualityOperator
src/application/services/interviewAdvanceService.ts:20:50
     currentStepId: number,
 ): InterviewStep | null => {
     const sorted = [...steps].sort((a, b) => a.orderIndex - b.orderIndex);
-    const currentIndex = sorted.findIndex((s) => s.id === currentStepId);
+    const currentIndex = sorted.findIndex((s) => s.id !== currentStepId);
 
     if (currentIndex === -1) {
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
-     "currentInterviewStep": 101,

[Killed] UnaryOperator
src/application/services/interviewAdvanceService.ts:22:26
     const sorted = [...steps].sort((a, b) => a.orderIndex - b.orderIndex);
     const currentIndex = sorted.findIndex((s) => s.id === currentStepId);
 
-    if (currentIndex === -1) {
+    if (currentIndex === +1) {
         throw new Error('Current interview step does not belong to this interview flow');
     }
killedBy: advanceCandidateToNextInterviewStep — step not in flow should throw when current step does not belong to the interview flow
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"applicationDate": 2026-05-06T01:33:01.668Z, "candidateId": 1, "currentInterviewStep": 101, "id": 1, "notes": null, "positionId": 10}

[Killed] ConditionalExpression
src/application/services/interviewAdvanceService.ts:22:9
     const sorted = [...steps].sort((a, b) => a.orderIndex - b.orderIndex);
     const currentIndex = sorted.findIndex((s) => s.id === currentStepId);
 
-    if (currentIndex === -1) {
+    if (false) {
         throw new Error('Current interview step does not belong to this interview flow');
     }
killedBy: advanceCandidateToNextInterviewStep — step not in flow should throw when current step does not belong to the interview flow
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"applicationDate": 2026-05-06T01:33:01.613Z, "candidateId": 1, "currentInterviewStep": 101, "id": 1, "notes": null, "positionId": 10}

[Killed] ConditionalExpression
src/application/services/interviewAdvanceService.ts:26:9
         throw new Error('Current interview step does not belong to this interview flow');
     }
 
-    if (currentIndex === sorted.length - 1) {
+    if (true) {
         return null;
     }
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Candidate is already in the last interview step

[Killed] EqualityOperator
src/application/services/interviewAdvanceService.ts:26:9
         throw new Error('Current interview step does not belong to this interview flow');
     }
 
-    if (currentIndex === sorted.length - 1) {
+    if (currentIndex !== sorted.length - 1) {
         return null;
     }
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Candidate is already in the last interview step

[Killed] ArithmeticOperator
src/application/services/interviewAdvanceService.ts:30:19
         return null;
     }
 
-    return sorted[currentIndex + 1];
+    return sorted[currentIndex - 1];
 };
 
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Candidate is already in the last interview step

[Killed] BlockStatement
src/application/services/interviewAdvanceService.ts:33:91
     return sorted[currentIndex + 1];
 };
 
-const findApplicationForCandidate = async (applicationId: number, candidateId: number) => {
-    const application = await prisma.application.findFirst({
-        where: { id: applicationId, candidateId },
-    });
-    if (!application) {
-        throw new Error('Application not found');
-    }
-    return application;
-};
+const findApplicationForCandidate = async (applicationId: number, candidateId: number) => {};
 
 const getInterviewStepsForApplication = async (positionId: number) => {
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: TypeError: Cannot read properties of undefined (reading 'positionId')

[Survived] ObjectLiteral
src/application/services/interviewAdvanceService.ts:35:16
 
 const findApplicationForCandidate = async (applicationId: number, candidateId: number) => {
     const application = await prisma.application.findFirst({
-        where: { id: applicationId, candidateId },
+        where: {},
     });
     if (!application) {

[Killed] BooleanLiteral
src/application/services/interviewAdvanceService.ts:37:9
     const application = await prisma.application.findFirst({
         where: { id: applicationId, candidateId },
     });
-    if (!application) {
+    if (application) {
         throw new Error('Application not found');
     }
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Application not found

[Killed] ConditionalExpression
src/application/services/interviewAdvanceService.ts:37:9
     const application = await prisma.application.findFirst({
         where: { id: applicationId, candidateId },
     });
-    if (!application) {
+    if (false) {
         throw new Error('Application not found');
     }
killedBy: advanceCandidateToNextInterviewStep — application not found should throw when application does not exist
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Application not found"
Received message:   "Cannot read properties of null (reading 'positionId')"

      140 |     stryCov_9fa48("122");
      141 |     const application = await findApplicationForCandidate(applicationId, candidateId);
    > 142 |     const steps = await getInterviewStepsForApplication(application.positionId)

[Killed] BlockStatement
src/application/services/interviewAdvanceService.ts:43:71
     return application;
 };
 
-const getInterviewStepsForApplication = async (positionId: number) => {
-    const position = await prisma.position.findUnique({
-        where: { id: positionId },
-        include: {
-            interviewFlow: {
-                include: { interviewSteps: true },
-            },
-        },
-    });
-    if (!position) {
-        throw new Error('Position not found');
-    }
-    return position.interviewFlow.interviewSteps;
-};
+const getInterviewStepsForApplication = async (positionId: number) => {};
 
 export const advanceCandidateToNextInterviewStep = async (
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ObjectLiteral
src/application/services/interviewAdvanceService.ts:47:28
     const position = await prisma.position.findUnique({
         where: { id: positionId },
         include: {
-            interviewFlow: {
-                include: { interviewSteps: true },
-            },
+            interviewFlow: {},
         },
     });

[Survived] BooleanLiteral
src/application/services/interviewAdvanceService.ts:48:44
         where: { id: positionId },
         include: {
             interviewFlow: {
-                include: { interviewSteps: true },
+                include: { interviewSteps: false },
             },
         },

[Survived] ObjectLiteral
src/application/services/interviewAdvanceService.ts:48:26
         where: { id: positionId },
         include: {
             interviewFlow: {
-                include: { interviewSteps: true },
+                include: {},
             },
         },

[Killed] BooleanLiteral
src/application/services/interviewAdvanceService.ts:52:9
             },
         },
     });
-    if (!position) {
+    if (position) {
         throw new Error('Position not found');
     }
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Position not found

[Killed] ConditionalExpression
src/application/services/interviewAdvanceService.ts:52:9
             },
         },
     });
-    if (!position) {
+    if (true) {
         throw new Error('Position not found');
     }
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Position not found

[NoCoverage] StringLiteral
src/application/services/interviewAdvanceService.ts:53:25
         },
     });
     if (!position) {
-        throw new Error('Position not found');
+        throw new Error("");
     }
     return position.interviewFlow.interviewSteps;

[Killed] BlockStatement
src/application/services/interviewAdvanceService.ts:61:6
 export const advanceCandidateToNextInterviewStep = async (
     candidateId: number,
     applicationId: number,
-) => {
-    const application = await findApplicationForCandidate(applicationId, candidateId);
-    const steps = await getInterviewStepsForApplication(application.positionId);
-    const nextStep = findNextInterviewStep(steps, application.currentInterviewStep);
-
-    if (!nextStep) {
-        throw new Error('Candidate is already in the last interview step');
-    }
-
-    return await prisma.application.update({
-        where: { id: application.id },
-        data: { currentInterviewStep: nextStep.id },
-    });
-};
+) => {};
 
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"data": {"currentInterviewStep": 101}, "where": {"id": 1}}

Number of calls: 0

[Killed] ConditionalExpression
src/application/services/interviewAdvanceService.ts:66:9
     const steps = await getInterviewStepsForApplication(application.positionId);
     const nextStep = findNextInterviewStep(steps, application.currentInterviewStep);
 
-    if (!nextStep) {
+    if (false) {
         throw new Error('Candidate is already in the last interview step');
     }
killedBy: advanceCandidateToNextInterviewStep — already at last step should throw when candidate is already in the last interview step
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Candidate is already in the last interview step"
Received message:   "Cannot read properties of null (reading 'id')"

      155 |       }),
      156 |       data: stryMutAct_9fa48("130") ? {} : (stryCov_9fa48("130"), {
    > 157 |         currentInterviewStep: nextStep.id

[Killed] ConditionalExpression
src/application/services/interviewAdvanceService.ts:66:9
     const steps = await getInterviewStepsForApplication(application.positionId);
     const nextStep = findNextInterviewStep(steps, application.currentInterviewStep);
 
-    if (!nextStep) {
+    if (true) {
         throw new Error('Candidate is already in the last interview step');
     }
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: Candidate is already in the last interview step

[Killed] ObjectLiteral
src/application/services/interviewAdvanceService.ts:72:15
 
     return await prisma.application.update({
         where: { id: application.id },
-        data: { currentInterviewStep: nextStep.id },
+        data: {},
     });
 };
killedBy: advanceCandidateToNextInterviewStep — happy path should advance from step 1 to step 2 in a 3-step flow
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Object {
-     "currentInterviewStep": 101,
