[Killed] BlockStatement
src/application/services/positionService.ts:6:54
 
 const prisma = new PrismaClient();
 
-const calculateAverageScore = (interviews: any[]) => {
-    if (interviews.length === 0) return 0;
-    const totalScore = interviews.reduce((acc, interview) => acc + (interview.score || 0), 0);
-    return totalScore / interviews.length;
-};
+const calculateAverageScore = (interviews: any[]) => {};
 
 export const getCandidatesByPositionService = async (positionId: number) => {
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "applicationId": 1,

[Killed] ConditionalExpression
src/application/services/positionService.ts:7:9
 const prisma = new PrismaClient();
 
 const calculateAverageScore = (interviews: any[]) => {
-    if (interviews.length === 0) return 0;
+    if (true) return 0;
     const totalScore = interviews.reduce((acc, interview) => acc + (interview.score || 0), 0);
     return totalScore / interviews.length;
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "applicationId": 1,

[Killed] EqualityOperator
src/application/services/positionService.ts:7:9
 const prisma = new PrismaClient();
 
 const calculateAverageScore = (interviews: any[]) => {
-    if (interviews.length === 0) return 0;
+    if (interviews.length !== 0) return 0;
     const totalScore = interviews.reduce((acc, interview) => acc + (interview.score || 0), 0);
     return totalScore / interviews.length;
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "applicationId": 1,

[Killed] ArithmeticOperator
src/application/services/positionService.ts:8:62
 
 const calculateAverageScore = (interviews: any[]) => {
     if (interviews.length === 0) return 0;
-    const totalScore = interviews.reduce((acc, interview) => acc + (interview.score || 0), 0);
+    const totalScore = interviews.reduce((acc, interview) => acc - (interview.score || 0), 0);
     return totalScore / interviews.length;
 };
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "applicationId": 1,

[Killed] LogicalOperator
src/application/services/positionService.ts:8:69
 
 const calculateAverageScore = (interviews: any[]) => {
     if (interviews.length === 0) return 0;
-    const totalScore = interviews.reduce((acc, interview) => acc + (interview.score || 0), 0);
+    const totalScore = interviews.reduce((acc, interview) => acc + (interview.score && 0), 0);
     return totalScore / interviews.length;
 };
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "applicationId": 1,

[Killed] ArithmeticOperator
src/application/services/positionService.ts:9:12
 const calculateAverageScore = (interviews: any[]) => {
     if (interviews.length === 0) return 0;
     const totalScore = interviews.reduce((acc, interview) => acc + (interview.score || 0), 0);
-    return totalScore / interviews.length;
+    return totalScore * interviews.length;
 };
 
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "applicationId": 1,

[Killed] BlockStatement
src/application/services/positionService.ts:12:77
     return totalScore / interviews.length;
 };
 
-export const getCandidatesByPositionService = async (positionId: number) => {
-    try {
-        const applications = await prisma.application.findMany({
-            where: { positionId },
-            include: {
-                candidate: true,
-                interviews: true,
-                interviewStep: true
-            }
-        });
-
-        return applications.map(app => ({
-            fullName: `${app.candidate.firstName} ${app.candidate.lastName}`,
-            currentInterviewStep: app.interviewStep.name,
-            candidateId: app.candidateId,
-            applicationId: app.id,
-            averageScore: calculateAverageScore(app.interviews)
-        }));
-    } catch (error) {
-        console.error('Error retrieving candidates by position:', error);
-        throw new Error('Error retrieving candidates by position');
-    }
-};
+export const getCandidatesByPositionService = async (positionId: number) => {};
 
 export const getInterviewFlowByPositionService = async (positionId: number) => {
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"applicationId": 1, "averageScore": 4, "candidateId": 1, "currentInterviewStep": "Technical Interview", "fullName": "John Doe"}]
Received: undefined

[Killed] BlockStatement
src/application/services/positionService.ts:13:9
 };
 
 export const getCandidatesByPositionService = async (positionId: number) => {
-    try {
-        const applications = await prisma.application.findMany({
-            where: { positionId },
-            include: {
-                candidate: true,
-                interviews: true,
-                interviewStep: true
-            }
-        });
-
-        return applications.map(app => ({
-            fullName: `${app.candidate.firstName} ${app.candidate.lastName}`,
-            currentInterviewStep: app.interviewStep.name,
-            candidateId: app.candidateId,
-            applicationId: app.id,
-            averageScore: calculateAverageScore(app.interviews)
-        }));
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error retrieving candidates by position:', error);
         throw new Error('Error retrieving candidates by position');
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"applicationId": 1, "averageScore": 4, "candidateId": 1, "currentInterviewStep": "Technical Interview", "fullName": "John Doe"}]
Received: undefined

[Survived] ObjectLiteral
src/application/services/positionService.ts:15:20
 export const getCandidatesByPositionService = async (positionId: number) => {
     try {
         const applications = await prisma.application.findMany({
-            where: { positionId },
+            where: {},
             include: {
                 candidate: true,

[Survived] BooleanLiteral
src/application/services/positionService.ts:17:28
         const applications = await prisma.application.findMany({
             where: { positionId },
             include: {
-                candidate: true,
+                candidate: false,
                 interviews: true,
                 interviewStep: true

[Survived] BooleanLiteral
src/application/services/positionService.ts:18:29
             where: { positionId },
             include: {
                 candidate: true,
-                interviews: true,
+                interviews: false,
                 interviewStep: true
             }

[Survived] BooleanLiteral
src/application/services/positionService.ts:19:32
             include: {
                 candidate: true,
                 interviews: true,
-                interviewStep: true
+                interviewStep: false
             }
         });

[Killed] ArrowFunction
src/application/services/positionService.ts:23:33
             }
         });
 
-        return applications.map(app => ({
-            fullName: `${app.candidate.firstName} ${app.candidate.lastName}`,
-            currentInterviewStep: app.interviewStep.name,
-            candidateId: app.candidateId,
-            applicationId: app.id,
-            averageScore: calculateAverageScore(app.interviews)
-        }));
+        return applications.map(() => undefined);
     } catch (error) {
         console.error('Error retrieving candidates by position:', error);
killedBy: getCandidatesByPositionService should return candidates with their average scores
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

  Array [
-   Object {
-     "applicationId": 1,

[NoCoverage] BlockStatement
src/application/services/positionService.ts:30:21
             applicationId: app.id,
             averageScore: calculateAverageScore(app.interviews)
         }));
-    } catch (error) {
-        console.error('Error retrieving candidates by position:', error);
-        throw new Error('Error retrieving candidates by position');
-    }
+    } catch (error) {}
 };
 

[NoCoverage] StringLiteral
src/application/services/positionService.ts:31:23
             averageScore: calculateAverageScore(app.interviews)
         }));
     } catch (error) {
-        console.error('Error retrieving candidates by position:', error);
+        console.error("", error);
         throw new Error('Error retrieving candidates by position');
     }

[NoCoverage] ObjectLiteral
src/application/services/positionService.ts:37:72
 };
 
 export const getInterviewFlowByPositionService = async (positionId: number) => {
-    const positionWithInterviewFlow = await prisma.position.findUnique({
-        where: { id: positionId },
-        include: {
-            interviewFlow: {
-                include: {
-                    interviewSteps: true
-                }
-            }
-        }
-    });
+    const positionWithInterviewFlow = await prisma.position.findUnique({});
 
     if (!positionWithInterviewFlow) {

[NoCoverage] ObjectLiteral
src/application/services/positionService.ts:38:16
 
 export const getInterviewFlowByPositionService = async (positionId: number) => {
     const positionWithInterviewFlow = await prisma.position.findUnique({
-        where: { id: positionId },
+        where: {},
         include: {
             interviewFlow: {

[NoCoverage] ObjectLiteral
src/application/services/positionService.ts:39:18
 export const getInterviewFlowByPositionService = async (positionId: number) => {
     const positionWithInterviewFlow = await prisma.position.findUnique({
         where: { id: positionId },
-        include: {
-            interviewFlow: {
-                include: {
-                    interviewSteps: true
-                }
-            }
-        }
+        include: {}
     });
 

[NoCoverage] ObjectLiteral
src/application/services/positionService.ts:40:28
     const positionWithInterviewFlow = await prisma.position.findUnique({
         where: { id: positionId },
         include: {
-            interviewFlow: {
-                include: {
-                    interviewSteps: true
-                }
-            }
+            interviewFlow: {}
         }
     });

[NoCoverage] BooleanLiteral
src/application/services/positionService.ts:42:37
         include: {
             interviewFlow: {
                 include: {
-                    interviewSteps: true
+                    interviewSteps: false
                 }
             }

[NoCoverage] ConditionalExpression
src/application/services/positionService.ts:48:9
         }
     });
 
-    if (!positionWithInterviewFlow) {
+    if (false) {
         throw new Error('Position not found');
     }

[NoCoverage] BooleanLiteral
src/application/services/positionService.ts:48:9
         }
     });
 
-    if (!positionWithInterviewFlow) {
+    if (positionWithInterviewFlow) {
         throw new Error('Position not found');
     }

[NoCoverage] ArrowFunction
src/application/services/positionService.ts:58:88
         interviewFlow: {
             id: positionWithInterviewFlow.interviewFlow.id,
             description: positionWithInterviewFlow.interviewFlow.description,
-            interviewSteps: positionWithInterviewFlow.interviewFlow.interviewSteps.map(step => ({
-                id: step.id,
-                interviewFlowId: step.interviewFlowId,
-                interviewTypeId: step.interviewTypeId,
-                name: step.name,
-                orderIndex: step.orderIndex
-            }))
+            interviewSteps: positionWithInterviewFlow.interviewFlow.interviewSteps.map(() => undefined)
         }
     };

[NoCoverage] BlockStatement
src/application/services/positionService.ts:69:51
     };
 };
 
-export const getAllPositionsService = async () => {
-    try {
-        return await prisma.position.findMany({
-            where: { isVisible: true }
-        });
-    } catch (error) {
-        console.error('Error retrieving all positions:', error);
-        throw new Error('Error retrieving all positions');
-    }
-};
+export const getAllPositionsService = async () => {};

[NoCoverage] BlockStatement
src/application/services/positionService.ts:70:9
 };
 
 export const getAllPositionsService = async () => {
-    try {
-        return await prisma.position.findMany({
-            where: { isVisible: true }
-        });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error retrieving all positions:', error);
         throw new Error('Error retrieving all positions');

[NoCoverage] BooleanLiteral
src/application/services/positionService.ts:72:33
 export const getAllPositionsService = async () => {
     try {
         return await prisma.position.findMany({
-            where: { isVisible: true }
+            where: { isVisible: false }
         });
     } catch (error) {

[NoCoverage] BlockStatement
src/application/services/positionService.ts:74:21
         return await prisma.position.findMany({
             where: { isVisible: true }
         });
-    } catch (error) {
-        console.error('Error retrieving all positions:', error);
-        throw new Error('Error retrieving all positions');
-    }
+    } catch (error) {}
 };
