[Killed] Regex
src/application/validator.ts:1:20
-const NAME_REGEX = /^[a-zA-ZñÑáéíóúÁÉÍÓÚ ]+$/;
+const NAME_REGEX = /[a-zA-ZñÑáéíóúÁÉÍÓÚ ]+$/;
 const EMAIL_REGEX = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
 const SPANISH_LOCAL_PHONE = '(6|7|9)\\d{8}';
killedBy: validateName (firstName / lastName) [CORRECT] should reject name with special characters
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid name"

Received function did not throw

[Killed] Regex
src/application/validator.ts:2:21
 const NAME_REGEX = /^[a-zA-ZñÑáéíóúÁÉÍÓÚ ]+$/;
-const EMAIL_REGEX = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
+const EMAIL_REGEX = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[^a-zA-Z]{2,}$/;
 const SPANISH_LOCAL_PHONE = '(6|7|9)\\d{8}';
 const INTERNATIONAL_PHONE = '\\+\\d{7,15}';
killedBy: validateName (firstName / lastName) [CORRECT] should accept 2-character name
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid email"

      80 |       } else {
      81 |         stryCov_9fa48("226");
    > 82 |         throw new Error(stryMutAct_9fa48("227") ? "" : (stryCov_9fa48("227"), 'Invalid email'));

[Killed] Regex
src/application/validator.ts:2:21
 const NAME_REGEX = /^[a-zA-ZñÑáéíóúÁÉÍÓÚ ]+$/;
-const EMAIL_REGEX = /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
+const EMAIL_REGEX = /^[a-zA-Z0-9._%+-]@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/;
 const SPANISH_LOCAL_PHONE = '(6|7|9)\\d{8}';
 const INTERNATIONAL_PHONE = '\\+\\d{7,15}';
killedBy: validateName (firstName / lastName) [CORRECT] should accept 2-character name
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid email"

      80 |       } else {
      81 |         stryCov_9fa48("226");
    > 82 |         throw new Error(stryMutAct_9fa48("227") ? "" : (stryCov_9fa48("227"), 'Invalid email'));

[Killed] Regex
src/application/validator.ts:6:20
 const SPANISH_LOCAL_PHONE = '(6|7|9)\\d{8}';
 const INTERNATIONAL_PHONE = '\\+\\d{7,15}';
 const PHONE_REGEX = new RegExp(`^(${INTERNATIONAL_PHONE}|${SPANISH_LOCAL_PHONE})$`);
-const DATE_REGEX = /^\d{4}-\d{2}-\d{2}$/;
+const DATE_REGEX = /^\d{4}-\d-\d{2}$/;
 
 //Length validations according to the database schema
killedBy: educations [CORRECT] should accept valid education entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid date"

      110 |       } else {
      111 |         stryCov_9fa48("241");
    > 112 |         throw new Error(stryMutAct_9fa48("242") ? "" : (stryCov_9fa48("242"), 'Invalid date'));

[Killed] Regex
src/application/validator.ts:6:20
 const SPANISH_LOCAL_PHONE = '(6|7|9)\\d{8}';
 const INTERNATIONAL_PHONE = '\\+\\d{7,15}';
 const PHONE_REGEX = new RegExp(`^(${INTERNATIONAL_PHONE}|${SPANISH_LOCAL_PHONE})$`);
-const DATE_REGEX = /^\d{4}-\d{2}-\d{2}$/;
+const DATE_REGEX = /^\D{4}-\d{2}-\d{2}$/;
 
 //Length validations according to the database schema
killedBy: educations [CORRECT] should accept valid education entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid date"

      110 |       } else {
      111 |         stryCov_9fa48("241");
    > 112 |         throw new Error(stryMutAct_9fa48("242") ? "" : (stryCov_9fa48("242"), 'Invalid date'));

[Killed] BlockStatement
src/application/validator.ts:10:40
 
 //Length validations according to the database schema
 
-const validateName = (name: string) => {
-    if (!name || name.length < 2 || name.length > 100 || !NAME_REGEX.test(name)) {
-        throw new Error('Invalid name');
-    }
-};
+const validateName = (name: string) => {};
 
 const validateEmail = (email: string) => {
killedBy: id bypass [CORRECT] should NOT skip validation when id is 0 (falsy)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid name"
Received message:   "Invalid email"

      80 |       } else {
      81 |         stryCov_9fa48("226");
    > 82 |         throw new Error(stryMutAct_9fa48("227") ? "" : (stryCov_9fa48("227"), 'Invalid email'));

[Killed] EqualityOperator
src/application/validator.ts:11:37
 //Length validations according to the database schema
 
 const validateName = (name: string) => {
-    if (!name || name.length < 2 || name.length > 100 || !NAME_REGEX.test(name)) {
+    if (!name || name.length < 2 || name.length >= 100 || !NAME_REGEX.test(name)) {
         throw new Error('Invalid name');
     }
killedBy: validateName (firstName / lastName) [LEGACY] should accept name with 100 chars (validator limit)
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid name"

      65 |       } else {
      66 |         stryCov_9fa48("218");
    > 67 |         throw new Error(stryMutAct_9fa48("219") ? "" : (stryCov_9fa48("219"), 'Invalid name'));

[Killed] ConditionalExpression
src/application/validator.ts:11:9
 //Length validations according to the database schema
 
 const validateName = (name: string) => {
-    if (!name || name.length < 2 || name.length > 100 || !NAME_REGEX.test(name)) {
+    if (true) {
         throw new Error('Invalid name');
     }
killedBy: validateName (firstName / lastName) [CORRECT] should accept 2-character name
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid name"

      65 |       } else {
      66 |         stryCov_9fa48("218");
    > 67 |         throw new Error(stryMutAct_9fa48("219") ? "" : (stryCov_9fa48("219"), 'Invalid name'));

[Killed] StringLiteral
src/application/validator.ts:12:25
 
 const validateName = (name: string) => {
     if (!name || name.length < 2 || name.length > 100 || !NAME_REGEX.test(name)) {
-        throw new Error('Invalid name');
+        throw new Error("");
     }
 };
killedBy: id bypass [CORRECT] should NOT skip validation when id is 0 (falsy)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid name"
Received message:   ""

      65 |       } else {
      66 |         stryCov_9fa48("218");
    > 67 |         throw new Error(stryMutAct_9fa48("219") ? "" : (stryCov_9fa48("219"), 'Invalid name'));

[Killed] BlockStatement
src/application/validator.ts:16:42
     }
 };
 
-const validateEmail = (email: string) => {
-    if (!email || !EMAIL_REGEX.test(email)) {
-        throw new Error('Invalid email');
-    }
-};
+const validateEmail = (email: string) => {};
 
 const validatePhone = (phone: string) => {
killedBy: validateEmail [CORRECT] should reject missing email
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid email"

Received function did not throw

[Killed] BooleanLiteral
src/application/validator.ts:17:19
 };
 
 const validateEmail = (email: string) => {
-    if (!email || !EMAIL_REGEX.test(email)) {
+    if (!email || EMAIL_REGEX.test(email)) {
         throw new Error('Invalid email');
     }
killedBy: validateName (firstName / lastName) [CORRECT] should accept 2-character name
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid email"

      80 |       } else {
      81 |         stryCov_9fa48("226");
    > 82 |         throw new Error(stryMutAct_9fa48("227") ? "" : (stryCov_9fa48("227"), 'Invalid email'));

[Killed] ConditionalExpression
src/application/validator.ts:17:9
 };
 
 const validateEmail = (email: string) => {
-    if (!email || !EMAIL_REGEX.test(email)) {
+    if (false) {
         throw new Error('Invalid email');
     }
killedBy: validateEmail [CORRECT] should reject missing email
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid email"

Received function did not throw

[Killed] StringLiteral
src/application/validator.ts:18:25
 
 const validateEmail = (email: string) => {
     if (!email || !EMAIL_REGEX.test(email)) {
-        throw new Error('Invalid email');
+        throw new Error("");
     }
 };
killedBy: validateEmail [CORRECT] should reject missing email
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid email"
Received message:   ""

      80 |       } else {
      81 |         stryCov_9fa48("226");
    > 82 |         throw new Error(stryMutAct_9fa48("227") ? "" : (stryCov_9fa48("227"), 'Invalid email'));

[Killed] BlockStatement
src/application/validator.ts:22:42
     }
 };
 
-const validatePhone = (phone: string) => {
-    if (phone && !PHONE_REGEX.test(phone)) {
-        throw new Error('Invalid phone');
-    }
-};
+const validatePhone = (phone: string) => {};
 
 const validateDate = (date: string) => {
killedBy: validatePhone [CORRECT] should reject phone starting with 5
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid phone"

Received function did not throw

[Killed] BooleanLiteral
src/application/validator.ts:23:18
 };
 
 const validatePhone = (phone: string) => {
-    if (phone && !PHONE_REGEX.test(phone)) {
+    if (phone && PHONE_REGEX.test(phone)) {
         throw new Error('Invalid phone');
     }
killedBy: validatePhone [CORRECT] should accept valid Spanish mobile starting with 6
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid phone"

       95 |       } else {
       96 |         stryCov_9fa48("233");
    >  97 |         throw new Error(stryMutAct_9fa48("234") ? "" : (stryCov_9fa48("234"), 'Invalid phone'));

[Killed] ConditionalExpression
src/application/validator.ts:23:9
 };
 
 const validatePhone = (phone: string) => {
-    if (phone && !PHONE_REGEX.test(phone)) {
+    if (false) {
         throw new Error('Invalid phone');
     }
killedBy: validatePhone [CORRECT] should reject phone starting with 5
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid phone"

Received function did not throw

[Killed] BlockStatement
src/application/validator.ts:28:40
     }
 };
 
-const validateDate = (date: string) => {
-    if (!date || !DATE_REGEX.test(date)) {
-        throw new Error('Invalid date');
-    }
-};
+const validateDate = (date: string) => {};
 
 const validateAddress = (address: string) => {
killedBy: educations [CORRECT] should reject education without startDate
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid date"

Received function did not throw

[Killed] BlockStatement
src/application/validator.ts:29:42
 };
 
 const validateDate = (date: string) => {
-    if (!date || !DATE_REGEX.test(date)) {
-        throw new Error('Invalid date');
-    }
+    if (!date || !DATE_REGEX.test(date)) {}
 };
 
killedBy: educations [CORRECT] should reject education without startDate
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid date"

Received function did not throw

[Killed] BooleanLiteral
src/application/validator.ts:29:18
 };
 
 const validateDate = (date: string) => {
-    if (!date || !DATE_REGEX.test(date)) {
+    if (!date || DATE_REGEX.test(date)) {
         throw new Error('Invalid date');
     }
killedBy: educations [CORRECT] should accept valid education entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid date"

      110 |       } else {
      111 |         stryCov_9fa48("241");
    > 112 |         throw new Error(stryMutAct_9fa48("242") ? "" : (stryCov_9fa48("242"), 'Invalid date'));

[Killed] BlockStatement
src/application/validator.ts:34:46
     }
 };
 
-const validateAddress = (address: string) => {
-    if (address && address.length > 100) {
-        throw new Error('Invalid address');
-    }
-};
+const validateAddress = (address: string) => {};
 
 const validateEducation = (education: any) => {
killedBy: validateAddress [CORRECT] should reject address with 101 chars
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid address"

Received function did not throw

[Killed] ConditionalExpression
src/application/validator.ts:35:9
 };
 
 const validateAddress = (address: string) => {
-    if (address && address.length > 100) {
+    if (true) {
         throw new Error('Invalid address');
     }
killedBy: validateName (firstName / lastName) [CORRECT] should accept 2-character name
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid address"

      125 |       } else {
      126 |         stryCov_9fa48("250");
    > 127 |         throw new Error(stryMutAct_9fa48("251") ? "" : (stryCov_9fa48("251"), 'Invalid address'));

[Killed] EqualityOperator
src/application/validator.ts:35:20
 };
 
 const validateAddress = (address: string) => {
-    if (address && address.length > 100) {
+    if (address && address.length >= 100) {
         throw new Error('Invalid address');
     }
killedBy: validateAddress [CORRECT] should accept address with 100 chars
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid address"

      125 |       } else {
      126 |         stryCov_9fa48("250");
    > 127 |         throw new Error(stryMutAct_9fa48("251") ? "" : (stryCov_9fa48("251"), 'Invalid address'));

[Killed] BlockStatement
src/application/validator.ts:40:47
     }
 };
 
-const validateEducation = (education: any) => {
-    if (!education.institution || education.institution.length > 100) {
-        throw new Error('Invalid institution');
-    }
-
-    if (!education.title || education.title.length > 100) {
-        throw new Error('Invalid title');
-    }
-
-    validateDate(education.startDate);
-
-    if (education.endDate && !DATE_REGEX.test(education.endDate)) {
-        throw new Error('Invalid end date');
-    }
-};
+const validateEducation = (education: any) => {};
 
 const validateExperience = (experience: any) => {
killedBy: educations [CORRECT] should reject education without institution
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid institution"

Received function did not throw

[Killed] LogicalOperator
src/application/validator.ts:41:9
 };
 
 const validateEducation = (education: any) => {
-    if (!education.institution || education.institution.length > 100) {
+    if (!education.institution && education.institution.length > 100) {
         throw new Error('Invalid institution');
     }
killedBy: educations [CORRECT] should reject education without institution
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid institution"
Received message:   "Cannot read properties of undefined (reading 'length')"

      135 |   } else {
      136 |     stryCov_9fa48("252");

[Killed] BooleanLiteral
src/application/validator.ts:41:9
 };
 
 const validateEducation = (education: any) => {
-    if (!education.institution || education.institution.length > 100) {
+    if (education.institution || education.institution.length > 100) {
         throw new Error('Invalid institution');
     }
killedBy: educations [CORRECT] should accept valid education entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid institution"

      140 |       } else {
      141 |         stryCov_9fa48("260");
    > 142 |         throw new Error(stryMutAct_9fa48("261") ? "" : (stryCov_9fa48("261"), 'Invalid institution'));

[Killed] LogicalOperator
src/application/validator.ts:45:9
         throw new Error('Invalid institution');
     }
 
-    if (!education.title || education.title.length > 100) {
+    if (!education.title && education.title.length > 100) {
         throw new Error('Invalid title');
     }
killedBy: educations [CORRECT] should reject education without title
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid title"
Received message:   "Cannot read properties of undefined (reading 'length')"

      143 |       }
      144 |     }

[Killed] ConditionalExpression
src/application/validator.ts:45:9
         throw new Error('Invalid institution');
     }
 
-    if (!education.title || education.title.length > 100) {
+    if (false) {
         throw new Error('Invalid title');
     }
killedBy: educations [CORRECT] should reject education without title
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid title"

Received function did not throw

[Killed] LogicalOperator
src/application/validator.ts:51:9
 
     validateDate(education.startDate);
 
-    if (education.endDate && !DATE_REGEX.test(education.endDate)) {
+    if (education.endDate || !DATE_REGEX.test(education.endDate)) {
         throw new Error('Invalid end date');
     }
killedBy: educations [CORRECT] should accept valid education entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid end date"

      157 |       } else {
      158 |         stryCov_9fa48("275");
    > 159 |         throw new Error(stryMutAct_9fa48("276") ? "" : (stryCov_9fa48("276"), 'Invalid end date'));

[Killed] BlockStatement
src/application/validator.ts:51:67
 
     validateDate(education.startDate);
 
-    if (education.endDate && !DATE_REGEX.test(education.endDate)) {
-        throw new Error('Invalid end date');
-    }
+    if (education.endDate && !DATE_REGEX.test(education.endDate)) {}
 };
 
killedBy: educations [CORRECT] should reject invalid endDate format
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid end date"

Received function did not throw

[Killed] BlockStatement
src/application/validator.ts:56:49
     }
 };
 
-const validateExperience = (experience: any) => {
-    if (!experience.company || experience.company.length > 100) {
-        throw new Error('Invalid company');
-    }
-
-    if (!experience.position || experience.position.length > 100) {
-        throw new Error('Invalid position');
-    }
-
-    if (experience.description && experience.description.length > 200) {
-        throw new Error('Invalid description');
-    }
-
-    validateDate(experience.startDate);
-
-    if (experience.endDate && !DATE_REGEX.test(experience.endDate)) {
-        throw new Error('Invalid end date');
-    }
-};
+const validateExperience = (experience: any) => {};
 
 const validateCV = (cv: any) => {
killedBy: workExperiences [CORRECT] should reject workExperience without company
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid company"

Received function did not throw

[Killed] BooleanLiteral
src/application/validator.ts:57:9
 };
 
 const validateExperience = (experience: any) => {
-    if (!experience.company || experience.company.length > 100) {
+    if (experience.company || experience.company.length > 100) {
         throw new Error('Invalid company');
     }
killedBy: workExperiences [CORRECT] should accept valid workExperience entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid company"

      172 |       } else {
      173 |         stryCov_9fa48("285");
    > 174 |         throw new Error(stryMutAct_9fa48("286") ? "" : (stryCov_9fa48("286"), 'Invalid company'));

[Killed] BlockStatement
src/application/validator.ts:57:65
 };
 
 const validateExperience = (experience: any) => {
-    if (!experience.company || experience.company.length > 100) {
-        throw new Error('Invalid company');
-    }
+    if (!experience.company || experience.company.length > 100) {}
 
     if (!experience.position || experience.position.length > 100) {
killedBy: workExperiences [CORRECT] should reject workExperience without company
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid company"

Received function did not throw

[Killed] BooleanLiteral
src/application/validator.ts:61:9
         throw new Error('Invalid company');
     }
 
-    if (!experience.position || experience.position.length > 100) {
+    if (experience.position || experience.position.length > 100) {
         throw new Error('Invalid position');
     }
killedBy: workExperiences [CORRECT] should accept valid workExperience entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid position"

      180 |       } else {
      181 |         stryCov_9fa48("294");
    > 182 |         throw new Error(stryMutAct_9fa48("295") ? "" : (stryCov_9fa48("295"), 'Invalid position'));

[Killed] LogicalOperator
src/application/validator.ts:61:9
         throw new Error('Invalid company');
     }
 
-    if (!experience.position || experience.position.length > 100) {
+    if (!experience.position && experience.position.length > 100) {
         throw new Error('Invalid position');
     }
killedBy: workExperiences [CORRECT] should reject workExperience without position
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid position"
Received message:   "Cannot read properties of undefined (reading 'length')"

      175 |       }
      176 |     }

[Killed] EqualityOperator
src/application/validator.ts:65:35
         throw new Error('Invalid position');
     }
 
-    if (experience.description && experience.description.length > 200) {
+    if (experience.description && experience.description.length >= 200) {
         throw new Error('Invalid description');
     }
killedBy: workExperiences [CORRECT] should accept description with 200 chars
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid description"

      188 |       } else {
      189 |         stryCov_9fa48("302");
    > 190 |         throw new Error(stryMutAct_9fa48("303") ? "" : (stryCov_9fa48("303"), 'Invalid description'));

[Killed] ConditionalExpression
src/application/validator.ts:65:9
         throw new Error('Invalid position');
     }
 
-    if (experience.description && experience.description.length > 200) {
+    if (true) {
         throw new Error('Invalid description');
     }
killedBy: workExperiences [CORRECT] should accept valid workExperience entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid description"

      188 |       } else {
      189 |         stryCov_9fa48("302");
    > 190 |         throw new Error(stryMutAct_9fa48("303") ? "" : (stryCov_9fa48("303"), 'Invalid description'));

[Killed] LogicalOperator
src/application/validator.ts:71:9
 
     validateDate(experience.startDate);
 
-    if (experience.endDate && !DATE_REGEX.test(experience.endDate)) {
+    if (experience.endDate || !DATE_REGEX.test(experience.endDate)) {
         throw new Error('Invalid end date');
     }
killedBy: workExperiences [CORRECT] should accept valid workExperience entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid end date"

      197 |       } else {
      198 |         stryCov_9fa48("308");
    > 199 |         throw new Error(stryMutAct_9fa48("309") ? "" : (stryCov_9fa48("309"), 'Invalid end date'));

[Killed] ConditionalExpression
src/application/validator.ts:71:9
 
     validateDate(experience.startDate);
 
-    if (experience.endDate && !DATE_REGEX.test(experience.endDate)) {
+    if (true) {
         throw new Error('Invalid end date');
     }
killedBy: workExperiences [CORRECT] should accept valid workExperience entry
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid end date"

      197 |       } else {
      198 |         stryCov_9fa48("308");
    > 199 |         throw new Error(stryMutAct_9fa48("309") ? "" : (stryCov_9fa48("309"), 'Invalid end date'));

[Killed] BlockStatement
src/application/validator.ts:76:33
     }
 };
 
-const validateCV = (cv: any) => {
-    if (typeof cv !== 'object' || !cv.filePath || typeof cv.filePath !== 'string' || !cv.fileType || typeof cv.fileType !== 'string') {
-        throw new Error('Invalid CV data');
-    }
-};
+const validateCV = (cv: any) => {};
 
 export const validateCandidateData = (data: any) => {
killedBy: cv [CORRECT] should reject cv without filePath
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid CV data"

Received function did not throw

[Killed] BlockStatement
src/application/validator.ts:77:135
 };
 
 const validateCV = (cv: any) => {
-    if (typeof cv !== 'object' || !cv.filePath || typeof cv.filePath !== 'string' || !cv.fileType || typeof cv.fileType !== 'string') {
-        throw new Error('Invalid CV data');
-    }
+    if (typeof cv !== 'object' || !cv.filePath || typeof cv.filePath !== 'string' || !cv.fileType || typeof cv.fileType !== 'string') {}
 };
 
killedBy: cv [CORRECT] should reject cv without filePath
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid CV data"

Received function did not throw

[Killed] ConditionalExpression
src/application/validator.ts:77:51
 };
 
 const validateCV = (cv: any) => {
-    if (typeof cv !== 'object' || !cv.filePath || typeof cv.filePath !== 'string' || !cv.fileType || typeof cv.fileType !== 'string') {
+    if (typeof cv !== 'object' || !cv.filePath || false || !cv.fileType || typeof cv.fileType !== 'string') {
         throw new Error('Invalid CV data');
     }
killedBy: cv [CORRECT] should reject cv when filePath is not a string
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid CV data"

Received function did not throw

[Killed] BlockStatement
src/application/validator.ts:83:18
 };
 
 export const validateCandidateData = (data: any) => {
-    if (data.id) {
-        // If id is provided, we are editing an existing candidate, so fields are not mandatory
-        return;
-    }
+    if (data.id) {}
 
     validateName(data.firstName); 
killedBy: id bypass [LEGACY] should skip all validation when id is truthy (number)
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid name"

      65 |       } else {
      66 |         stryCov_9fa48("218");
    > 67 |         throw new Error(stryMutAct_9fa48("219") ? "" : (stryCov_9fa48("219"), 'Invalid name'));

[Killed] ConditionalExpression
src/application/validator.ts:83:9
 };
 
 export const validateCandidateData = (data: any) => {
-    if (data.id) {
+    if (true) {
         // If id is provided, we are editing an existing candidate, so fields are not mandatory
         return;
killedBy: id bypass [CORRECT] should NOT skip validation when id is 0 (falsy)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid name"

Received function did not throw

[Killed] ConditionalExpression
src/application/validator.ts:94:9
     validatePhone(data.phone);
     validateAddress(data.address);
 
-    if (data.educations) {
+    if (false) {
         for (const education of data.educations) {
             validateEducation(education);
killedBy: educations [CORRECT] should reject education without institution
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid institution"

Received function did not throw

[Killed] BlockStatement
src/application/validator.ts:94:26
     validatePhone(data.phone);
     validateAddress(data.address);
 
-    if (data.educations) {
-        for (const education of data.educations) {
-            validateEducation(education);
-        }
-    }
+    if (data.educations) {}
 
     if (data.workExperiences) {
killedBy: educations [CORRECT] should reject education without institution
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid institution"

Received function did not throw

[Killed] BlockStatement
src/application/validator.ts:95:50
     validateAddress(data.address);
 
     if (data.educations) {
-        for (const education of data.educations) {
-            validateEducation(education);
-        }
+        for (const education of data.educations) {}
     }
 
killedBy: educations [CORRECT] should reject education without institution
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid institution"

Received function did not throw

[Killed] ConditionalExpression
src/application/validator.ts:100:9
         }
     }
 
-    if (data.workExperiences) {
+    if (true) {
         for (const experience of data.workExperiences) {
             validateExperience(experience);
killedBy: validateName (firstName / lastName) [CORRECT] should accept 2-character name
statusReason: Error: expect(received).not.toThrow()

Error name:    "TypeError"
Error message: "Cannot read properties of undefined (reading 'length')"

      256 |       } else {
      257 |         stryCov_9fa48("343");
    > 258 |         for (const experience of data.workExperiences) {

[Killed] BlockStatement
src/application/validator.ts:100:31
         }
     }
 
-    if (data.workExperiences) {
-        for (const experience of data.workExperiences) {
-            validateExperience(experience);
-        }
-    }
+    if (data.workExperiences) {}
 
     if (data.cv && Object.keys(data.cv).length > 0) {
killedBy: workExperiences [CORRECT] should reject workExperience without company
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid company"

Received function did not throw

[Killed] BlockStatement
src/application/validator.ts:101:56
     }
 
     if (data.workExperiences) {
-        for (const experience of data.workExperiences) {
-            validateExperience(experience);
-        }
+        for (const experience of data.workExperiences) {}
     }
 
killedBy: workExperiences [CORRECT] should reject workExperience without company
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid company"

Received function did not throw
