[Killed] ConditionalExpression
src/application/validator.ts:106:9
         }
     }
 
-    if (data.cv && Object.keys(data.cv).length > 0) {
+    if (true) {
         validateCV(data.cv);
     }
killedBy: validateName (firstName / lastName) [CORRECT] should accept 2-character name
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Invalid CV data"

      212 |       } else {
      213 |         stryCov_9fa48("331");
    > 214 |         throw new Error(stryMutAct_9fa48("332") ? "" : (stryCov_9fa48("332"), 'Invalid CV data'));

[Killed] BlockStatement
src/application/validator.ts:106:53
         }
     }
 
-    if (data.cv && Object.keys(data.cv).length > 0) {
-        validateCV(data.cv);
-    }
+    if (data.cv && Object.keys(data.cv).length > 0) {}
 };
killedBy: cv [CORRECT] should reject cv without filePath
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid CV data"

Received function did not throw
