[Killed] BlockStatement
src/domain/models/Application.ts:15:28
     notes?: string;
     interviews: Interview[]; // Added this line
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.positionId = data.positionId;
-        this.candidateId = data.candidateId;
-        this.applicationDate = new Date(data.applicationDate);
-        this.currentInterviewStep = data.currentInterviewStep;
-        this.notes = data.notes;
-        this.interviews = data.interviews || []; // Added this line
-    }
+    constructor(data: any) {}
 
     async save() {
killedBy: updateCandidateStage should update the candidate stage and return the updated application
statusReason: Error: TypeError: prisma.application.create is not a function

[Survived] LogicalOperator
src/domain/models/Application.ts:22:27
         this.applicationDate = new Date(data.applicationDate);
         this.currentInterviewStep = data.currentInterviewStep;
         this.notes = data.notes;
-        this.interviews = data.interviews || []; // Added this line
+        this.interviews = data.interviews && []; // Added this line
     }
 

[Survived] ConditionalExpression
src/domain/models/Application.ts:22:27
         this.applicationDate = new Date(data.applicationDate);
         this.currentInterviewStep = data.currentInterviewStep;
         this.notes = data.notes;
-        this.interviews = data.interviews || []; // Added this line
+        this.interviews = true; // Added this line
     }
 

[Survived] BlockStatement
src/domain/models/Application.ts:25:18
         this.interviews = data.interviews || []; // Added this line
     }
 
-    async save() {
-        const applicationData: any = {
-            positionId: this.positionId,
-            candidateId: this.candidateId,
-            applicationDate: this.applicationDate,
-            currentInterviewStep: this.currentInterviewStep,
-            notes: this.notes,
-        };
-
-        if (this.id) {
-            return await prisma.application.update({
-                where: { id: this.id },
-                data: applicationData,
-            });
-        } else {
-            return await prisma.application.create({
-                data: applicationData,
-            });
-        }
-    }
+    async save() {}
 
     static async findOne(id: number): Promise<Application | null> {

[Killed] ConditionalExpression
src/domain/models/Application.ts:34:13
             notes: this.notes,
         };
 
-        if (this.id) {
+        if (false) {
             return await prisma.application.update({
                 where: { id: this.id },
killedBy: updateCandidateStage should update the candidate stage and return the updated application
statusReason: Error: TypeError: prisma.application.create is not a function

[Survived] ConditionalExpression
src/domain/models/Application.ts:34:13
             notes: this.notes,
         };
 
-        if (this.id) {
+        if (true) {
             return await prisma.application.update({
                 where: { id: this.id },

[NoCoverage] BlockStatement
src/domain/models/Application.ts:39:16
                 where: { id: this.id },
                 data: applicationData,
             });
-        } else {
-            return await prisma.application.create({
-                data: applicationData,
-            });
-        }
+        } else {}
     }
 

[NoCoverage] BlockStatement
src/domain/models/Application.ts:46:67
         }
     }
 
-    static async findOne(id: number): Promise<Application | null> {
-        const data = await prisma.application.findUnique({
-            where: { id: id },
-        });
-        if (!data) return null;
-        return new Application(data);
-    }
+    static async findOne(id: number): Promise<Application | null> {}
 
     static async findOneByPositionCandidateId(applicationIdNumber: number, candidateId: number): Promise<Application | null> {

[NoCoverage] BooleanLiteral
src/domain/models/Application.ts:50:13
         const data = await prisma.application.findUnique({
             where: { id: id },
         });
-        if (!data) return null;
+        if (data) return null;
         return new Application(data);
     }

[NoCoverage] ConditionalExpression
src/domain/models/Application.ts:50:13
         const data = await prisma.application.findUnique({
             where: { id: id },
         });
-        if (!data) return null;
+        if (true) return null;
         return new Application(data);
     }

[Killed] BlockStatement
src/domain/models/Application.ts:54:126
         return new Application(data);
     }
 
-    static async findOneByPositionCandidateId(applicationIdNumber: number, candidateId: number): Promise<Application | null> {
-        const data = await prisma.application.findFirst({
-            where: {
-                id: applicationIdNumber,
-                candidateId: candidateId
-            }
-        });
-        if (!data) return null;
-        return new Application(data);
-    }
+    static async findOneByPositionCandidateId(applicationIdNumber: number, candidateId: number): Promise<Application | null> {}
 }
 
killedBy: updateCandidateStage should update the candidate stage and return the updated application
statusReason: Error: Error: Application not found
