[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:21:28
     resumes: Resume[];
     applications: Application[];
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.firstName = data.firstName;
-        this.lastName = data.lastName;
-        this.email = data.email;
-        this.phone = data.phone;
-        this.address = data.address;
-        this.educations = data.educations || [];
-        this.workExperiences = data.workExperiences || [];
-        this.resumes = data.resumes || [];
-        this.applications = data.applications || [];
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:28:27
         this.email = data.email;
         this.phone = data.phone;
         this.address = data.address;
-        this.educations = data.educations || [];
+        this.educations = true;
         this.workExperiences = data.workExperiences || [];
         this.resumes = data.resumes || [];

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:28:27
         this.email = data.email;
         this.phone = data.phone;
         this.address = data.address;
-        this.educations = data.educations || [];
+        this.educations = false;
         this.workExperiences = data.workExperiences || [];
         this.resumes = data.resumes || [];

[NoCoverage] LogicalOperator
src/domain/models/Candidate.ts:29:32
         this.phone = data.phone;
         this.address = data.address;
         this.educations = data.educations || [];
-        this.workExperiences = data.workExperiences || [];
+        this.workExperiences = data.workExperiences && [];
         this.resumes = data.resumes || [];
         this.applications = data.applications || [];

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:29:32
         this.phone = data.phone;
         this.address = data.address;
         this.educations = data.educations || [];
-        this.workExperiences = data.workExperiences || [];
+        this.workExperiences = false;
         this.resumes = data.resumes || [];
         this.applications = data.applications || [];

[NoCoverage] LogicalOperator
src/domain/models/Candidate.ts:30:24
         this.address = data.address;
         this.educations = data.educations || [];
         this.workExperiences = data.workExperiences || [];
-        this.resumes = data.resumes || [];
+        this.resumes = data.resumes && [];
         this.applications = data.applications || [];
     }

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:30:24
         this.address = data.address;
         this.educations = data.educations || [];
         this.workExperiences = data.workExperiences || [];
-        this.resumes = data.resumes || [];
+        this.resumes = false;
         this.applications = data.applications || [];
     }

[NoCoverage] LogicalOperator
src/domain/models/Candidate.ts:31:29
         this.educations = data.educations || [];
         this.workExperiences = data.workExperiences || [];
         this.resumes = data.resumes || [];
-        this.applications = data.applications || [];
+        this.applications = data.applications && [];
     }
 

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:31:29
         this.educations = data.educations || [];
         this.workExperiences = data.workExperiences || [];
         this.resumes = data.resumes || [];
-        this.applications = data.applications || [];
+        this.applications = true;
     }
 

[NoCoverage] EqualityOperator
src/domain/models/Candidate.ts:38:13
         const candidateData: any = {};
 
         // Solo añadir al objeto candidateData los campos que no son undefined
-        if (this.firstName !== undefined) candidateData.firstName = this.firstName;
+        if (this.firstName === undefined) candidateData.firstName = this.firstName;
         if (this.lastName !== undefined) candidateData.lastName = this.lastName;
         if (this.email !== undefined) candidateData.email = this.email;

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:38:13
         const candidateData: any = {};
 
         // Solo añadir al objeto candidateData los campos que no son undefined
-        if (this.firstName !== undefined) candidateData.firstName = this.firstName;
+        if (true) candidateData.firstName = this.firstName;
         if (this.lastName !== undefined) candidateData.lastName = this.lastName;
         if (this.email !== undefined) candidateData.email = this.email;

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:39:13
 
         // Solo añadir al objeto candidateData los campos que no son undefined
         if (this.firstName !== undefined) candidateData.firstName = this.firstName;
-        if (this.lastName !== undefined) candidateData.lastName = this.lastName;
+        if (true) candidateData.lastName = this.lastName;
         if (this.email !== undefined) candidateData.email = this.email;
         if (this.phone !== undefined) candidateData.phone = this.phone;

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:39:13
 
         // Solo añadir al objeto candidateData los campos que no son undefined
         if (this.firstName !== undefined) candidateData.firstName = this.firstName;
-        if (this.lastName !== undefined) candidateData.lastName = this.lastName;
+        if (false) candidateData.lastName = this.lastName;
         if (this.email !== undefined) candidateData.email = this.email;
         if (this.phone !== undefined) candidateData.phone = this.phone;

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:40:13
         // Solo añadir al objeto candidateData los campos que no son undefined
         if (this.firstName !== undefined) candidateData.firstName = this.firstName;
         if (this.lastName !== undefined) candidateData.lastName = this.lastName;
-        if (this.email !== undefined) candidateData.email = this.email;
+        if (true) candidateData.email = this.email;
         if (this.phone !== undefined) candidateData.phone = this.phone;
         if (this.address !== undefined) candidateData.address = this.address;

[NoCoverage] EqualityOperator
src/domain/models/Candidate.ts:40:13
         // Solo añadir al objeto candidateData los campos que no son undefined
         if (this.firstName !== undefined) candidateData.firstName = this.firstName;
         if (this.lastName !== undefined) candidateData.lastName = this.lastName;
-        if (this.email !== undefined) candidateData.email = this.email;
+        if (this.email === undefined) candidateData.email = this.email;
         if (this.phone !== undefined) candidateData.phone = this.phone;
         if (this.address !== undefined) candidateData.address = this.address;

[NoCoverage] EqualityOperator
src/domain/models/Candidate.ts:41:13
         if (this.firstName !== undefined) candidateData.firstName = this.firstName;
         if (this.lastName !== undefined) candidateData.lastName = this.lastName;
         if (this.email !== undefined) candidateData.email = this.email;
-        if (this.phone !== undefined) candidateData.phone = this.phone;
+        if (this.phone === undefined) candidateData.phone = this.phone;
         if (this.address !== undefined) candidateData.address = this.address;
 

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:41:13
         if (this.firstName !== undefined) candidateData.firstName = this.firstName;
         if (this.lastName !== undefined) candidateData.lastName = this.lastName;
         if (this.email !== undefined) candidateData.email = this.email;
-        if (this.phone !== undefined) candidateData.phone = this.phone;
+        if (true) candidateData.phone = this.phone;
         if (this.address !== undefined) candidateData.address = this.address;
 

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:42:13
         if (this.lastName !== undefined) candidateData.lastName = this.lastName;
         if (this.email !== undefined) candidateData.email = this.email;
         if (this.phone !== undefined) candidateData.phone = this.phone;
-        if (this.address !== undefined) candidateData.address = this.address;
+        if (false) candidateData.address = this.address;
 
         // Añadir educations si hay alguna para añadir

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:42:13
         if (this.lastName !== undefined) candidateData.lastName = this.lastName;
         if (this.email !== undefined) candidateData.email = this.email;
         if (this.phone !== undefined) candidateData.phone = this.phone;
-        if (this.address !== undefined) candidateData.address = this.address;
+        if (true) candidateData.address = this.address;
 
         // Añadir educations si hay alguna para añadir

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:45:13
         if (this.address !== undefined) candidateData.address = this.address;
 
         // Añadir educations si hay alguna para añadir
-        if (this.educations.length > 0) {
+        if (true) {
             candidateData.educations = {
                 create: this.educations.map(edu => ({

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:45:13
         if (this.address !== undefined) candidateData.address = this.address;
 
         // Añadir educations si hay alguna para añadir
-        if (this.educations.length > 0) {
+        if (false) {
             candidateData.educations = {
                 create: this.educations.map(edu => ({

[NoCoverage] ArrowFunction
src/domain/models/Candidate.ts:47:45
         // Añadir educations si hay alguna para añadir
         if (this.educations.length > 0) {
             candidateData.educations = {
-                create: this.educations.map(edu => ({
-                    institution: edu.institution,
-                    title: edu.title,
-                    startDate: edu.startDate,
-                    endDate: edu.endDate
-                }))
+                create: this.educations.map(() => undefined)
             };
         }

[NoCoverage] ObjectLiteral
src/domain/models/Candidate.ts:47:53
         // Añadir educations si hay alguna para añadir
         if (this.educations.length > 0) {
             candidateData.educations = {
-                create: this.educations.map(edu => ({
-                    institution: edu.institution,
-                    title: edu.title,
-                    startDate: edu.startDate,
-                    endDate: edu.endDate
-                }))
+                create: this.educations.map(edu => ({}))
             };
         }

[NoCoverage] EqualityOperator
src/domain/models/Candidate.ts:57:13
         }
 
         // Añadir workExperiences si hay alguna para añadir
-        if (this.workExperiences.length > 0) {
+        if (this.workExperiences.length >= 0) {
             candidateData.workExperiences = {
                 create: this.workExperiences.map(exp => ({

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:57:13
         }
 
         // Añadir workExperiences si hay alguna para añadir
-        if (this.workExperiences.length > 0) {
+        if (true) {
             candidateData.workExperiences = {
                 create: this.workExperiences.map(exp => ({

[NoCoverage] ObjectLiteral
src/domain/models/Candidate.ts:58:45
 
         // Añadir workExperiences si hay alguna para añadir
         if (this.workExperiences.length > 0) {
-            candidateData.workExperiences = {
-                create: this.workExperiences.map(exp => ({
-                    company: exp.company,
-                    position: exp.position,
-                    description: exp.description,
-                    startDate: exp.startDate,
-                    endDate: exp.endDate
-                }))
-            };
+            candidateData.workExperiences = {};
         }
 

[NoCoverage] ArrowFunction
src/domain/models/Candidate.ts:59:50
         // Añadir workExperiences si hay alguna para añadir
         if (this.workExperiences.length > 0) {
             candidateData.workExperiences = {
-                create: this.workExperiences.map(exp => ({
-                    company: exp.company,
-                    position: exp.position,
-                    description: exp.description,
-                    startDate: exp.startDate,
-                    endDate: exp.endDate
-                }))
+                create: this.workExperiences.map(() => undefined)
             };
         }

[NoCoverage] ObjectLiteral
src/domain/models/Candidate.ts:59:58
         // Añadir workExperiences si hay alguna para añadir
         if (this.workExperiences.length > 0) {
             candidateData.workExperiences = {
-                create: this.workExperiences.map(exp => ({
-                    company: exp.company,
-                    position: exp.position,
-                    description: exp.description,
-                    startDate: exp.startDate,
-                    endDate: exp.endDate
-                }))
+                create: this.workExperiences.map(exp => ({}))
             };
         }

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:70:13
         }
 
         // Añadir resumes si hay alguno para añadir
-        if (this.resumes.length > 0) {
+        if (false) {
             candidateData.resumes = {
                 create: this.resumes.map(resume => ({

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:70:38
         }
 
         // Añadir resumes si hay alguno para añadir
-        if (this.resumes.length > 0) {
-            candidateData.resumes = {
-                create: this.resumes.map(resume => ({
-                    filePath: resume.filePath,
-                    fileType: resume.fileType
-                }))
-            };
-        }
+        if (this.resumes.length > 0) {}
 
         // Añadir applications si hay alguna para añadir

[NoCoverage] ArrowFunction
src/domain/models/Candidate.ts:72:42
         // Añadir resumes si hay alguno para añadir
         if (this.resumes.length > 0) {
             candidateData.resumes = {
-                create: this.resumes.map(resume => ({
-                    filePath: resume.filePath,
-                    fileType: resume.fileType
-                }))
+                create: this.resumes.map(() => undefined)
             };
         }

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:80:13
         }
 
         // Añadir applications si hay alguna para añadir
-        if (this.applications.length > 0) {
+        if (true) {
             candidateData.applications = {
                 create: this.applications.map(app => ({

[NoCoverage] EqualityOperator
src/domain/models/Candidate.ts:80:13
         }
 
         // Añadir applications si hay alguna para añadir
-        if (this.applications.length > 0) {
+        if (this.applications.length <= 0) {
             candidateData.applications = {
                 create: this.applications.map(app => ({

[NoCoverage] ArrowFunction
src/domain/models/Candidate.ts:82:47
         // Añadir applications si hay alguna para añadir
         if (this.applications.length > 0) {
             candidateData.applications = {
-                create: this.applications.map(app => ({
-                    positionId: app.positionId,
-                    candidateId: app.candidateId,
-                    applicationDate: app.applicationDate,
-                    currentInterviewStep: app.currentInterviewStep,
-                    notes: app.notes,
-                }))
+                create: this.applications.map(() => undefined)
             };
         }

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:92:22
             };
         }
 
-        if (this.id) {
-            // Actualizar un candidato existente
-            try {
-                return await prisma.candidate.update({
-                    where: { id: this.id },
-                    data: candidateData
-                });
-            } catch (error: any) {
-                console.log(error);
-                if (error instanceof Prisma.PrismaClientInitializationError) {
-                    // Database connection error
-                    throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
-                } else if (error.code === 'P2025') {
-                    // Record not found error
-                    throw new Error('No se pudo encontrar el registro del candidato con el ID proporcionado.');
-                } else {
-                    throw error;
-                }
-            }
-        } else {
+        if (this.id) {} else {
             // Crear un nuevo candidato
             try {

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:94:17
 
         if (this.id) {
             // Actualizar un candidato existente
-            try {
-                return await prisma.candidate.update({
-                    where: { id: this.id },
-                    data: candidateData
-                });
-            } catch (error: any) {
+            try {} catch (error: any) {
                 console.log(error);
                 if (error instanceof Prisma.PrismaClientInitializationError) {

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:99:34
                     where: { id: this.id },
                     data: candidateData
                 });
-            } catch (error: any) {
-                console.log(error);
-                if (error instanceof Prisma.PrismaClientInitializationError) {
-                    // Database connection error
-                    throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
-                } else if (error.code === 'P2025') {
-                    // Record not found error
-                    throw new Error('No se pudo encontrar el registro del candidato con el ID proporcionado.');
-                } else {
-                    throw error;
-                }
-            }
+            } catch (error: any) {}
         } else {
             // Crear un nuevo candidato

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:101:21
                 });
             } catch (error: any) {
                 console.log(error);
-                if (error instanceof Prisma.PrismaClientInitializationError) {
+                if (true) {
                     // Database connection error
                     throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:101:21
                 });
             } catch (error: any) {
                 console.log(error);
-                if (error instanceof Prisma.PrismaClientInitializationError) {
+                if (false) {
                     // Database connection error
                     throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:104:28
                 if (error instanceof Prisma.PrismaClientInitializationError) {
                     // Database connection error
                     throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
-                } else if (error.code === 'P2025') {
+                } else if (true) {
                     // Record not found error
                     throw new Error('No se pudo encontrar el registro del candidato con el ID proporcionado.');

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:104:28
                 if (error instanceof Prisma.PrismaClientInitializationError) {
                     // Database connection error
                     throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
-                } else if (error.code === 'P2025') {
+                } else if (false) {
                     // Record not found error
                     throw new Error('No se pudo encontrar el registro del candidato con el ID proporcionado.');

[NoCoverage] StringLiteral
src/domain/models/Candidate.ts:106:37
                     throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
                 } else if (error.code === 'P2025') {
                     // Record not found error
-                    throw new Error('No se pudo encontrar el registro del candidato con el ID proporcionado.');
+                    throw new Error("");
                 } else {
                     throw error;

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:107:24
                 } else if (error.code === 'P2025') {
                     // Record not found error
                     throw new Error('No se pudo encontrar el registro del candidato con el ID proporcionado.');
-                } else {
-                    throw error;
-                }
+                } else {}
             }
         } else {

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:111:16
                     throw error;
                 }
             }
-        } else {
-            // Crear un nuevo candidato
-            try {
-                const result = await prisma.candidate.create({
-                    data: candidateData
-                });
-                return result;
-            } catch (error: any) {
-                if (error instanceof Prisma.PrismaClientInitializationError) {
-                    // Database connection error
-                    throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
-                } else {
-                    throw error;
-                }
-            }
-        }
+        } else {}
     }
 

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:113:17
             }
         } else {
             // Crear un nuevo candidato
-            try {
-                const result = await prisma.candidate.create({
-                    data: candidateData
-                });
-                return result;
-            } catch (error: any) {
+            try {} catch (error: any) {
                 if (error instanceof Prisma.PrismaClientInitializationError) {
                     // Database connection error

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:118:34
                     data: candidateData
                 });
                 return result;
-            } catch (error: any) {
-                if (error instanceof Prisma.PrismaClientInitializationError) {
-                    // Database connection error
-                    throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
-                } else {
-                    throw error;
-                }
-            }
+            } catch (error: any) {}
         }
     }

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:119:21
                 });
                 return result;
             } catch (error: any) {
-                if (error instanceof Prisma.PrismaClientInitializationError) {
+                if (false) {
                     // Database connection error
                     throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:119:78
                 });
                 return result;
             } catch (error: any) {
-                if (error instanceof Prisma.PrismaClientInitializationError) {
-                    // Database connection error
-                    throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
-                } else {
+                if (error instanceof Prisma.PrismaClientInitializationError) {} else {
                     throw error;
                 }

[NoCoverage] BlockStatement
src/domain/models/Candidate.ts:122:24
                 if (error instanceof Prisma.PrismaClientInitializationError) {
                     // Database connection error
                     throw new Error('No se pudo conectar con la base de datos. Por favor, asegúrese de que el servidor de base de datos esté en ejecución.');
-                } else {
-                    throw error;
-                }
+                } else {}
             }
         }

[NoCoverage] BooleanLiteral
src/domain/models/Candidate.ts:133:29
         const data = await prisma.candidate.findUnique({
             where: { id: id },
             include: {
-                educations: true,
+                educations: false,
                 workExperiences: true,
                 resumes: true,

[NoCoverage] BooleanLiteral
src/domain/models/Candidate.ts:134:34
             where: { id: id },
             include: {
                 educations: true,
-                workExperiences: true,
+                workExperiences: false,
                 resumes: true,
                 applications: {

[NoCoverage] BooleanLiteral
src/domain/models/Candidate.ts:135:26
             include: {
                 educations: true,
                 workExperiences: true,
-                resumes: true,
+                resumes: false,
                 applications: {
                     include: {

[NoCoverage] ObjectLiteral
src/domain/models/Candidate.ts:136:31
                 educations: true,
                 workExperiences: true,
                 resumes: true,
-                applications: {
-                    include: {
-                        position: {
-                            select: {
-                                id: true,
-                                title: true
-                            }
-                        },
-                        interviews: {
-                            select: {
-                                interviewDate: true,
-                                interviewStep: {
-                                    select: {
-                                        name: true
-                                    }
-                                },
-                                notes: true,
-                                score: true
-                            }
-                        }
-                    }
-                }
+                applications: {}
             }
         });

[NoCoverage] ObjectLiteral
src/domain/models/Candidate.ts:138:35
                 resumes: true,
                 applications: {
                     include: {
-                        position: {
-                            select: {
-                                id: true,
-                                title: true
-                            }
-                        },
+                        position: {},
                         interviews: {
                             select: {

[NoCoverage] BooleanLiteral
src/domain/models/Candidate.ts:141:40
                         position: {
                             select: {
                                 id: true,
-                                title: true
+                                title: false
                             }
                         },

[NoCoverage] ObjectLiteral
src/domain/models/Candidate.ts:145:37
                             }
                         },
                         interviews: {
-                            select: {
-                                interviewDate: true,
-                                interviewStep: {
-                                    select: {
-                                        name: true
-                                    }
-                                },
-                                notes: true,
-                                score: true
-                            }
+                            select: {}
                         }
                     }

[NoCoverage] BooleanLiteral
src/domain/models/Candidate.ts:146:48
                         },
                         interviews: {
                             select: {
-                                interviewDate: true,
+                                interviewDate: false,
                                 interviewStep: {
                                     select: {

[NoCoverage] ObjectLiteral
src/domain/models/Candidate.ts:148:45
                             select: {
                                 interviewDate: true,
                                 interviewStep: {
-                                    select: {
-                                        name: true
-                                    }
+                                    select: {}
                                 },
                                 notes: true,

[NoCoverage] BooleanLiteral
src/domain/models/Candidate.ts:149:47
                                 interviewDate: true,
                                 interviewStep: {
                                     select: {
-                                        name: true
+                                        name: false
                                     }
                                 },
