[NoCoverage] BooleanLiteral
src/domain/models/Candidate.ts:152:40
                                         name: true
                                     }
                                 },
-                                notes: true,
+                                notes: false,
                                 score: true
                             }

[NoCoverage] BooleanLiteral
src/domain/models/Candidate.ts:153:40
                                     }
                                 },
                                 notes: true,
-                                score: true
+                                score: false
                             }
                         }

[NoCoverage] ConditionalExpression
src/domain/models/Candidate.ts:160:13
                 }
             }
         });
-        if (!data) return null;
+        if (false) return null;
         return new Candidate(data);
     }
