[NoCoverage] BlockStatement
src/domain/models/Company.ts:9:28
     id?: number;
     name: string;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.name = data.name;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] BlockStatement
src/domain/models/Company.ts:14:18
         this.name = data.name;
     }
 
-    async save() {
-        const companyData: any = {
-            name: this.name,
-        };
-
-        if (this.id) {
-            return await prisma.company.update({
-                where: { id: this.id },
-                data: companyData,
-            });
-        } else {
-            return await prisma.company.create({
-                data: companyData,
-            });
-        }
-    }
+    async save() {}
 
     static async findOne(id: number): Promise<Company | null> {

[NoCoverage] ObjectLiteral
src/domain/models/Company.ts:21:24
 
         if (this.id) {
             return await prisma.company.update({
-                where: { id: this.id },
+                where: {},
                 data: companyData,
             });

[NoCoverage] BlockStatement
src/domain/models/Company.ts:24:16
                 where: { id: this.id },
                 data: companyData,
             });
-        } else {
-            return await prisma.company.create({
-                data: companyData,
-            });
-        }
+        } else {}
     }
 

[NoCoverage] ObjectLiteral
src/domain/models/Company.ts:25:48
                 data: companyData,
             });
         } else {
-            return await prisma.company.create({
-                data: companyData,
-            });
+            return await prisma.company.create({});
         }
     }

[NoCoverage] BlockStatement
src/domain/models/Company.ts:31:63
         }
     }
 
-    static async findOne(id: number): Promise<Company | null> {
-        const data = await prisma.company.findUnique({
-            where: { id: id },
-        });
-        if (!data) return null;
-        return new Company(data);
-    }
+    static async findOne(id: number): Promise<Company | null> {}
 }
 
