[NoCoverage] BlockStatement
src/domain/models/Education.ts:13:28
     endDate?: Date;
     candidateId?: number;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.institution = data.institution;
-        this.title = data.title;
-        this.startDate = new Date(data.startDate);
-        this.endDate = data.endDate ? new Date(data.endDate) : undefined;
-        this.candidateId = data.candidateId;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] BlockStatement
src/domain/models/Education.ts:22:18
         this.candidateId = data.candidateId;
     }
 
-    async save() {
-        const educationData: any = {
-            institution: this.institution,
-            title: this.title,
-            startDate: this.startDate,
-            endDate: this.endDate,
-        };
-
-        if (this.candidateId !== undefined) {
-            educationData.candidateId = this.candidateId;
-        }
-
-        if (this.id) {
-            // Actualizar una experiencia laboral existente
-            return await prisma.education.update({
-                where: { id: this.id },
-                data: educationData
-            });
-        } else {
-            // Crear una nueva experiencia laboral
-            return await prisma.education.create({
-                data: educationData
-            });
-        }
-    }
+    async save() {}
 }
 

[NoCoverage] ConditionalExpression
src/domain/models/Education.ts:30:13
             endDate: this.endDate,
         };
 
-        if (this.candidateId !== undefined) {
+        if (false) {
             educationData.candidateId = this.candidateId;
         }

[NoCoverage] BlockStatement
src/domain/models/Education.ts:30:45
             endDate: this.endDate,
         };
 
-        if (this.candidateId !== undefined) {
-            educationData.candidateId = this.candidateId;
-        }
+        if (this.candidateId !== undefined) {}
 
         if (this.id) {

[NoCoverage] BlockStatement
src/domain/models/Education.ts:34:22
             educationData.candidateId = this.candidateId;
         }
 
-        if (this.id) {
-            // Actualizar una experiencia laboral existente
-            return await prisma.education.update({
-                where: { id: this.id },
-                data: educationData
-            });
-        } else {
+        if (this.id) {} else {
             // Crear una nueva experiencia laboral
             return await prisma.education.create({

[NoCoverage] BlockStatement
src/domain/models/Education.ts:40:16
                 where: { id: this.id },
                 data: educationData
             });
-        } else {
-            // Crear una nueva experiencia laboral
-            return await prisma.education.create({
-                data: educationData
-            });
-        }
+        } else {}
     }
 }
