[NoCoverage] BlockStatement
src/domain/models/Employee.ts:13:28
     role: string;
     isActive: boolean;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.companyId = data.companyId;
-        this.name = data.name;
-        this.email = data.email;
-        this.role = data.role;
-        this.isActive = data.isActive ?? true;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] LogicalOperator
src/domain/models/Employee.ts:19:25
         this.name = data.name;
         this.email = data.email;
         this.role = data.role;
-        this.isActive = data.isActive ?? true;
+        this.isActive = data.isActive && true;
     }
 

[NoCoverage] BooleanLiteral
src/domain/models/Employee.ts:19:42
         this.name = data.name;
         this.email = data.email;
         this.role = data.role;
-        this.isActive = data.isActive ?? true;
+        this.isActive = data.isActive ?? false;
     }
 

[NoCoverage] BlockStatement
src/domain/models/Employee.ts:22:18
         this.isActive = data.isActive ?? true;
     }
 
-    async save() {
-        const employeeData: any = {
-            companyId: this.companyId,
-            name: this.name,
-            email: this.email,
-            role: this.role,
-            isActive: this.isActive,
-        };
-
-        if (this.id) {
-            return await prisma.employee.update({
-                where: { id: this.id },
-                data: employeeData,
-            });
-        } else {
-            return await prisma.employee.create({
-                data: employeeData,
-            });
-        }
-    }
+    async save() {}
 
     static async findOne(id: number): Promise<Employee | null> {

[NoCoverage] BlockStatement
src/domain/models/Employee.ts:31:22
             isActive: this.isActive,
         };
 
-        if (this.id) {
-            return await prisma.employee.update({
-                where: { id: this.id },
-                data: employeeData,
-            });
-        } else {
+        if (this.id) {} else {
             return await prisma.employee.create({
                 data: employeeData,

[NoCoverage] ObjectLiteral
src/domain/models/Employee.ts:32:49
         };
 
         if (this.id) {
-            return await prisma.employee.update({
-                where: { id: this.id },
-                data: employeeData,
-            });
+            return await prisma.employee.update({});
         } else {
             return await prisma.employee.create({

[NoCoverage] BlockStatement
src/domain/models/Employee.ts:36:16
                 where: { id: this.id },
                 data: employeeData,
             });
-        } else {
-            return await prisma.employee.create({
-                data: employeeData,
-            });
-        }
+        } else {}
     }
 

[NoCoverage] BlockStatement
src/domain/models/Employee.ts:43:64
         }
     }
 
-    static async findOne(id: number): Promise<Employee | null> {
-        const data = await prisma.employee.findUnique({
-            where: { id: id },
-        });
-        if (!data) return null;
-        return new Employee(data);
-    }
+    static async findOne(id: number): Promise<Employee | null> {}
 }
 
