[NoCoverage] BlockStatement
src/domain/models/Interview.ts:15:28
     score?: number;
     notes?: string;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.applicationId = data.applicationId;
-        this.interviewStepId = data.interviewStepId;
-        this.employeeId = data.employeeId;
-        this.interviewDate = new Date(data.interviewDate);
-        this.result = data.result;
-        this.score = data.score;
-        this.notes = data.notes;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] BlockStatement
src/domain/models/Interview.ts:26:18
         this.notes = data.notes;
     }
 
-    async save() {
-        const interviewData: any = {
-            applicationId: this.applicationId,
-            interviewStepId: this.interviewStepId,
-            employeeId: this.employeeId,
-            interviewDate: this.interviewDate,
-            result: this.result,
-            score: this.score,
-            notes: this.notes,
-        };
-
-        if (this.id) {
-            return await prisma.interview.update({
-                where: { id: this.id },
-                data: interviewData,
-            });
-        } else {
-            return await prisma.interview.create({
-                data: interviewData,
-            });
-        }
-    }
+    async save() {}
 
     static async findOne(id: number): Promise<Interview | null> {

[NoCoverage] BlockStatement
src/domain/models/Interview.ts:37:22
             notes: this.notes,
         };
 
-        if (this.id) {
-            return await prisma.interview.update({
-                where: { id: this.id },
-                data: interviewData,
-            });
-        } else {
+        if (this.id) {} else {
             return await prisma.interview.create({
                 data: interviewData,

[NoCoverage] ObjectLiteral
src/domain/models/Interview.ts:38:50
         };
 
         if (this.id) {
-            return await prisma.interview.update({
-                where: { id: this.id },
-                data: interviewData,
-            });
+            return await prisma.interview.update({});
         } else {
             return await prisma.interview.create({

[NoCoverage] BlockStatement
src/domain/models/Interview.ts:42:16
                 where: { id: this.id },
                 data: interviewData,
             });
-        } else {
-            return await prisma.interview.create({
-                data: interviewData,
-            });
-        }
+        } else {}
     }
 

[NoCoverage] BlockStatement
src/domain/models/Interview.ts:49:65
         }
     }
 
-    static async findOne(id: number): Promise<Interview | null> {
-        const data = await prisma.interview.findUnique({
-            where: { id: id },
-        });
-        if (!data) return null;
-        return new Interview(data);
-    }
+    static async findOne(id: number): Promise<Interview | null> {}
 }
