[NoCoverage] BlockStatement
src/domain/models/InterviewFlow.ts:9:28
     id?: number;
     description?: string;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.description = data.description;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] BlockStatement
src/domain/models/InterviewFlow.ts:14:18
         this.description = data.description;
     }
 
-    async save() {
-        const interviewFlowData: any = {
-            description: this.description,
-        };
-
-        if (this.id) {
-            return await prisma.interviewFlow.update({
-                where: { id: this.id },
-                data: interviewFlowData,
-            });
-        } else {
-            return await prisma.interviewFlow.create({
-                data: interviewFlowData,
-            });
-        }
-    }
+    async save() {}
 
     static async findOne(id: number): Promise<InterviewFlow | null> {

[NoCoverage] BlockStatement
src/domain/models/InterviewFlow.ts:19:22
             description: this.description,
         };
 
-        if (this.id) {
-            return await prisma.interviewFlow.update({
-                where: { id: this.id },
-                data: interviewFlowData,
-            });
-        } else {
+        if (this.id) {} else {
             return await prisma.interviewFlow.create({
                 data: interviewFlowData,

[NoCoverage] ObjectLiteral
src/domain/models/InterviewFlow.ts:20:54
         };
 
         if (this.id) {
-            return await prisma.interviewFlow.update({
-                where: { id: this.id },
-                data: interviewFlowData,
-            });
+            return await prisma.interviewFlow.update({});
         } else {
             return await prisma.interviewFlow.create({

[NoCoverage] BlockStatement
src/domain/models/InterviewFlow.ts:24:16
                 where: { id: this.id },
                 data: interviewFlowData,
             });
-        } else {
-            return await prisma.interviewFlow.create({
-                data: interviewFlowData,
-            });
-        }
+        } else {}
     }
 

[NoCoverage] BlockStatement
src/domain/models/InterviewFlow.ts:31:69
         }
     }
 
-    static async findOne(id: number): Promise<InterviewFlow | null> {
-        const data = await prisma.interviewFlow.findUnique({
-            where: { id: id },
-        });
-        if (!data) return null;
-        return new InterviewFlow(data);
-    }
+    static async findOne(id: number): Promise<InterviewFlow | null> {}
 }
 
