[NoCoverage] BlockStatement
src/domain/models/InterviewStep.ts:12:28
     name: string;
     orderIndex: number;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.interviewFlowId = data.interviewFlowId;
-        this.interviewTypeId = data.interviewTypeId;
-        this.name = data.name;
-        this.orderIndex = data.orderIndex;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] BlockStatement
src/domain/models/InterviewStep.ts:20:18
         this.orderIndex = data.orderIndex;
     }
 
-    async save() {
-        const interviewStepData: any = {
-            interviewFlowId: this.interviewFlowId,
-            interviewTypeId: this.interviewTypeId,
-            name: this.name,
-            orderIndex: this.orderIndex,
-        };
-
-        if (this.id) {
-            return await prisma.interviewStep.update({
-                where: { id: this.id },
-                data: interviewStepData,
-            });
-        } else {
-            return await prisma.interviewStep.create({
-                data: interviewStepData,
-            });
-        }
-    }
+    async save() {}
 
     static async findOne(id: number): Promise<InterviewStep | null> {

[NoCoverage] BlockStatement
src/domain/models/InterviewStep.ts:28:22
             orderIndex: this.orderIndex,
         };
 
-        if (this.id) {
-            return await prisma.interviewStep.update({
-                where: { id: this.id },
-                data: interviewStepData,
-            });
-        } else {
+        if (this.id) {} else {
             return await prisma.interviewStep.create({
                 data: interviewStepData,

[NoCoverage] ObjectLiteral
src/domain/models/InterviewStep.ts:29:54
         };
 
         if (this.id) {
-            return await prisma.interviewStep.update({
-                where: { id: this.id },
-                data: interviewStepData,
-            });
+            return await prisma.interviewStep.update({});
         } else {
             return await prisma.interviewStep.create({

[NoCoverage] BlockStatement
src/domain/models/InterviewStep.ts:33:16
                 where: { id: this.id },
                 data: interviewStepData,
             });
-        } else {
-            return await prisma.interviewStep.create({
-                data: interviewStepData,
-            });
-        }
+        } else {}
     }
 

[NoCoverage] ObjectLiteral
src/domain/models/InterviewStep.ts:34:54
                 data: interviewStepData,
             });
         } else {
-            return await prisma.interviewStep.create({
-                data: interviewStepData,
-            });
+            return await prisma.interviewStep.create({});
         }
     }

[NoCoverage] BlockStatement
src/domain/models/InterviewStep.ts:40:69
         }
     }
 
-    static async findOne(id: number): Promise<InterviewStep | null> {
-        const data = await prisma.interviewStep.findUnique({
-            where: { id: id },
-        });
-        if (!data) return null;
-        return new InterviewStep(data);
-    }
+    static async findOne(id: number): Promise<InterviewStep | null> {}
 }
 

[NoCoverage] ObjectLiteral
src/domain/models/InterviewStep.ts:41:60
     }
 
     static async findOne(id: number): Promise<InterviewStep | null> {
-        const data = await prisma.interviewStep.findUnique({
-            where: { id: id },
-        });
+        const data = await prisma.interviewStep.findUnique({});
         if (!data) return null;
         return new InterviewStep(data);
