[NoCoverage] BlockStatement
src/domain/models/InterviewType.ts:10:28
     name: string;
     description?: string;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.name = data.name;
-        this.description = data.description;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] BlockStatement
src/domain/models/InterviewType.ts:16:18
         this.description = data.description;
     }
 
-    async save() {
-        const interviewTypeData: any = {
-            name: this.name,
-            description: this.description,
-        };
-
-        if (this.id) {
-            return await prisma.interviewType.update({
-                where: { id: this.id },
-                data: interviewTypeData,
-            });
-        } else {
-            return await prisma.interviewType.create({
-                data: interviewTypeData,
-            });
-        }
-    }
+    async save() {}
 
     static async findOne(id: number): Promise<InterviewType | null> {

[NoCoverage] ObjectLiteral
src/domain/models/InterviewType.ts:17:40
     }
 
     async save() {
-        const interviewTypeData: any = {
-            name: this.name,
-            description: this.description,
-        };
+        const interviewTypeData: any = {};
 
         if (this.id) {

[NoCoverage] BlockStatement
src/domain/models/InterviewType.ts:22:22
             description: this.description,
         };
 
-        if (this.id) {
-            return await prisma.interviewType.update({
-                where: { id: this.id },
-                data: interviewTypeData,
-            });
-        } else {
+        if (this.id) {} else {
             return await prisma.interviewType.create({
                 data: interviewTypeData,

[NoCoverage] ObjectLiteral
src/domain/models/InterviewType.ts:24:24
 
         if (this.id) {
             return await prisma.interviewType.update({
-                where: { id: this.id },
+                where: {},
                 data: interviewTypeData,
             });

[NoCoverage] BlockStatement
src/domain/models/InterviewType.ts:27:16
                 where: { id: this.id },
                 data: interviewTypeData,
             });
-        } else {
-            return await prisma.interviewType.create({
-                data: interviewTypeData,
-            });
-        }
+        } else {}
     }
 

[NoCoverage] BlockStatement
src/domain/models/InterviewType.ts:34:69
         }
     }
 
-    static async findOne(id: number): Promise<InterviewType | null> {
-        const data = await prisma.interviewType.findUnique({
-            where: { id: id },
-        });
-        if (!data) return null;
-        return new InterviewType(data);
-    }
+    static async findOne(id: number): Promise<InterviewType | null> {}
 }
 
