[NoCoverage] BlockStatement
src/domain/models/Position.ts:25:28
     applicationDeadline?: Date;
     contactInfo?: string;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.companyId = data.companyId;
-        this.interviewFlowId = data.interviewFlowId;
-        this.title = data.title;
-        this.description = data.description;
-        this.status = data.status ?? 'Draft';
-        this.isVisible = data.isVisible ?? false;
-        this.location = data.location;
-        this.jobDescription = data.jobDescription;
-        this.requirements = data.requirements;
-        this.responsibilities = data.responsibilities;
-        this.salaryMin = data.salaryMin;
-        this.salaryMax = data.salaryMax;
-        this.employmentType = data.employmentType;
-        this.benefits = data.benefits;
-        this.companyDescription = data.companyDescription;
-        this.applicationDeadline = data.applicationDeadline ? new Date(data.applicationDeadline) : undefined;
-        this.contactInfo = data.contactInfo;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] LogicalOperator
src/domain/models/Position.ts:31:23
         this.interviewFlowId = data.interviewFlowId;
         this.title = data.title;
         this.description = data.description;
-        this.status = data.status ?? 'Draft';
+        this.status = data.status && 'Draft';
         this.isVisible = data.isVisible ?? false;
         this.location = data.location;

[NoCoverage] StringLiteral
src/domain/models/Position.ts:31:38
         this.interviewFlowId = data.interviewFlowId;
         this.title = data.title;
         this.description = data.description;
-        this.status = data.status ?? 'Draft';
+        this.status = data.status ?? "";
         this.isVisible = data.isVisible ?? false;
         this.location = data.location;

[NoCoverage] BooleanLiteral
src/domain/models/Position.ts:32:44
         this.title = data.title;
         this.description = data.description;
         this.status = data.status ?? 'Draft';
-        this.isVisible = data.isVisible ?? false;
+        this.isVisible = data.isVisible ?? true;
         this.location = data.location;
         this.jobDescription = data.jobDescription;

[NoCoverage] LogicalOperator
src/domain/models/Position.ts:32:26
         this.title = data.title;
         this.description = data.description;
         this.status = data.status ?? 'Draft';
-        this.isVisible = data.isVisible ?? false;
+        this.isVisible = data.isVisible && false;
         this.location = data.location;
         this.jobDescription = data.jobDescription;

[NoCoverage] BlockStatement
src/domain/models/Position.ts:67:22
             contactInfo: this.contactInfo,
         };
 
-        if (this.id) {
-            return await prisma.position.update({
-                where: { id: this.id },
-                data: positionData,
-            });
-        } else {
+        if (this.id) {} else {
             return await prisma.position.create({
                 data: positionData,

[NoCoverage] ObjectLiteral
src/domain/models/Position.ts:69:24
 
         if (this.id) {
             return await prisma.position.update({
-                where: { id: this.id },
+                where: {},
                 data: positionData,
             });

[NoCoverage] BlockStatement
src/domain/models/Position.ts:72:16
                 where: { id: this.id },
                 data: positionData,
             });
-        } else {
-            return await prisma.position.create({
-                data: positionData,
-            });
-        }
+        } else {}
     }
 

[NoCoverage] BlockStatement
src/domain/models/Position.ts:79:64
         }
     }
 
-    static async findOne(id: number): Promise<Position | null> {
-        const data = await prisma.position.findUnique({
-            where: { id: id },
-        });
-        if (!data) return null;
-        return new Position(data);
-    }
+    static async findOne(id: number): Promise<Position | null> {}
 
     static async findOneWithInterviewFlow(id: number): Promise<Position | null> {

[NoCoverage] BlockStatement
src/domain/models/Position.ts:87:81
         return new Position(data);
     }
 
-    static async findOneWithInterviewFlow(id: number): Promise<Position | null> {
-        const data = await prisma.position.findUnique({
-            where: { id: id },
-            include: {
-                interviewFlow: {
-                    include: {
-                        interviewSteps: true
-                    }
-                }
-            }
-        });
-        if (!data) return null;
-        return new Position(data)
-    }
+    static async findOneWithInterviewFlow(id: number): Promise<Position | null> {}
 }
 

[NoCoverage] ObjectLiteral
src/domain/models/Position.ts:88:55
     }
 
     static async findOneWithInterviewFlow(id: number): Promise<Position | null> {
-        const data = await prisma.position.findUnique({
-            where: { id: id },
-            include: {
-                interviewFlow: {
-                    include: {
-                        interviewSteps: true
-                    }
-                }
-            }
-        });
+        const data = await prisma.position.findUnique({});
         if (!data) return null;
         return new Position(data)

[NoCoverage] ObjectLiteral
src/domain/models/Position.ts:89:20
 
     static async findOneWithInterviewFlow(id: number): Promise<Position | null> {
         const data = await prisma.position.findUnique({
-            where: { id: id },
+            where: {},
             include: {
                 interviewFlow: {
