[NoCoverage] BlockStatement
src/domain/models/Resume.ts:12:28
     fileType: string;
     uploadDate: Date;
 
-    constructor(data: any) {
-        this.id = data?.id;
-        this.candidateId = data?.candidateId;
-        this.filePath = data?.filePath;
-        this.fileType = data?.fileType;
-        this.uploadDate = new Date();
-    }
+    constructor(data: any) {}
 
     async save(): Promise<Resume> {

[NoCoverage] OptionalChaining
src/domain/models/Resume.ts:13:19
     uploadDate: Date;
 
     constructor(data: any) {
-        this.id = data?.id;
+        this.id = data.id;
         this.candidateId = data?.candidateId;
         this.filePath = data?.filePath;

[NoCoverage] OptionalChaining
src/domain/models/Resume.ts:14:28
 
     constructor(data: any) {
         this.id = data?.id;
-        this.candidateId = data?.candidateId;
+        this.candidateId = data.candidateId;
         this.filePath = data?.filePath;
         this.fileType = data?.fileType;

[NoCoverage] OptionalChaining
src/domain/models/Resume.ts:15:25
     constructor(data: any) {
         this.id = data?.id;
         this.candidateId = data?.candidateId;
-        this.filePath = data?.filePath;
+        this.filePath = data.filePath;
         this.fileType = data?.fileType;
         this.uploadDate = new Date();

[NoCoverage] OptionalChaining
src/domain/models/Resume.ts:16:25
         this.id = data?.id;
         this.candidateId = data?.candidateId;
         this.filePath = data?.filePath;
-        this.fileType = data?.fileType;
+        this.fileType = data.fileType;
         this.uploadDate = new Date();
     }

[NoCoverage] BlockStatement
src/domain/models/Resume.ts:20:35
         this.uploadDate = new Date();
     }
 
-    async save(): Promise<Resume> {
-        if (!this.id) {
-            return await this.create();
-        }
-        throw new Error('No se permite la actualización de un currículum existente.');
-    }
+    async save(): Promise<Resume> {}
 
     async create(): Promise<Resume> {

[NoCoverage] BlockStatement
src/domain/models/Resume.ts:21:23
     }
 
     async save(): Promise<Resume> {
-        if (!this.id) {
-            return await this.create();
-        }
+        if (!this.id) {}
         throw new Error('No se permite la actualización de un currículum existente.');
     }

[NoCoverage] BooleanLiteral
src/domain/models/Resume.ts:21:13
     }
 
     async save(): Promise<Resume> {
-        if (!this.id) {
+        if (this.id) {
             return await this.create();
         }

[NoCoverage] BlockStatement
src/domain/models/Resume.ts:27:37
         throw new Error('No se permite la actualización de un currículum existente.');
     }
 
-    async create(): Promise<Resume> {
-        console.log(this);
-
-        const createdResume = await prisma.resume.create({
-            data: {
-                candidateId: this.candidateId,
-                filePath: this.filePath,
-                fileType: this.fileType,
-                uploadDate: this.uploadDate
-            },
-        });
-        return new Resume(createdResume);
-    }
+    async create(): Promise<Resume> {}
 }

[NoCoverage] ObjectLiteral
src/domain/models/Resume.ts:30:58
     async create(): Promise<Resume> {
         console.log(this);
 
-        const createdResume = await prisma.resume.create({
-            data: {
-                candidateId: this.candidateId,
-                filePath: this.filePath,
-                fileType: this.fileType,
-                uploadDate: this.uploadDate
-            },
-        });
+        const createdResume = await prisma.resume.create({});
         return new Resume(createdResume);
     }
