[NoCoverage] BlockStatement
src/domain/models/WorkExperience.ts:14:28
     endDate?: Date;
     candidateId?: number;
 
-    constructor(data: any) {
-        this.id = data.id;
-        this.company = data.company;
-        this.position = data.position;
-        this.description = data.description;
-        this.startDate = new Date(data.startDate);
-        this.endDate = data.endDate ? new Date(data.endDate) : undefined;
-        this.candidateId = data.candidateId;
-    }
+    constructor(data: any) {}
 
     async save() {

[NoCoverage] BlockStatement
src/domain/models/WorkExperience.ts:33:45
             endDate: this.endDate
         };
 
-        if (this.candidateId !== undefined) {
-            workExperienceData.candidateId = this.candidateId;
-        }
+        if (this.candidateId !== undefined) {}
 
         if (this.id) {

[NoCoverage] BlockStatement
src/domain/models/WorkExperience.ts:37:22
             workExperienceData.candidateId = this.candidateId;
         }
 
-        if (this.id) {
-            // Actualizar una experiencia laboral existente
-            return await prisma.workExperience.update({
-                where: { id: this.id },
-                data: workExperienceData
-            });
-        } else {
+        if (this.id) {} else {
             // Crear una nueva experiencia laboral
             return await prisma.workExperience.create({

[NoCoverage] BlockStatement
src/domain/models/WorkExperience.ts:43:16
                 where: { id: this.id },
                 data: workExperienceData
             });
-        } else {
-            // Crear una nueva experiencia laboral
-            return await prisma.workExperience.create({
-                data: workExperienceData
-            });
-        }
+        } else {}
     }
 }

[NoCoverage] ObjectLiteral
src/domain/models/WorkExperience.ts:45:55
             });
         } else {
             // Crear una nueva experiencia laboral
-            return await prisma.workExperience.create({
-                data: workExperienceData
-            });
+            return await prisma.workExperience.create({});
         }
     }
