[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:4:78
 import { Request, Response } from 'express';
 import { addCandidate, findCandidateById, updateCandidateStage } from '../../application/services/candidateService';
 
-export const addCandidateController = async (req: Request, res: Response) => {
-    try {
-        const candidateData = req.body;
-        const candidate = await addCandidate(candidateData);
-        res.status(201).json({ message: 'Candidate added successfully', data: candidate });
-    } catch (error: unknown) {
-        if (error instanceof Error) {
-            res.status(400).json({ message: 'Error adding candidate', error: error.message });
-        } else {
-            res.status(400).json({ message: 'Error adding candidate', error: 'Unknown error' });
-        }
-    }
-};
+export const addCandidateController = async (req: Request, res: Response) => {};
 
 export const getCandidateById = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:5:9
 import { addCandidate, findCandidateById, updateCandidateStage } from '../../application/services/candidateService';
 
 export const addCandidateController = async (req: Request, res: Response) => {
-    try {
-        const candidateData = req.body;
-        const candidate = await addCandidate(candidateData);
-        res.status(201).json({ message: 'Candidate added successfully', data: candidate });
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         if (error instanceof Error) {
             res.status(400).json({ message: 'Error adding candidate', error: error.message });

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:9:30
         const candidateData = req.body;
         const candidate = await addCandidate(candidateData);
         res.status(201).json({ message: 'Candidate added successfully', data: candidate });
-    } catch (error: unknown) {
-        if (error instanceof Error) {
-            res.status(400).json({ message: 'Error adding candidate', error: error.message });
-        } else {
-            res.status(400).json({ message: 'Error adding candidate', error: 'Unknown error' });
-        }
-    }
+    } catch (error: unknown) {}
 };
 

[NoCoverage] ConditionalExpression
src/presentation/controllers/candidateController.ts:10:13
         const candidate = await addCandidate(candidateData);
         res.status(201).json({ message: 'Candidate added successfully', data: candidate });
     } catch (error: unknown) {
-        if (error instanceof Error) {
+        if (false) {
             res.status(400).json({ message: 'Error adding candidate', error: error.message });
         } else {

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:10:37
         const candidate = await addCandidate(candidateData);
         res.status(201).json({ message: 'Candidate added successfully', data: candidate });
     } catch (error: unknown) {
-        if (error instanceof Error) {
-            res.status(400).json({ message: 'Error adding candidate', error: error.message });
-        } else {
+        if (error instanceof Error) {} else {
             res.status(400).json({ message: 'Error adding candidate', error: 'Unknown error' });
         }

[NoCoverage] StringLiteral
src/presentation/controllers/candidateController.ts:11:45
         res.status(201).json({ message: 'Candidate added successfully', data: candidate });
     } catch (error: unknown) {
         if (error instanceof Error) {
-            res.status(400).json({ message: 'Error adding candidate', error: error.message });
+            res.status(400).json({ message: "", error: error.message });
         } else {
             res.status(400).json({ message: 'Error adding candidate', error: 'Unknown error' });

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:12:16
     } catch (error: unknown) {
         if (error instanceof Error) {
             res.status(400).json({ message: 'Error adding candidate', error: error.message });
-        } else {
-            res.status(400).json({ message: 'Error adding candidate', error: 'Unknown error' });
-        }
+        } else {}
     }
 };

[NoCoverage] StringLiteral
src/presentation/controllers/candidateController.ts:13:45
         if (error instanceof Error) {
             res.status(400).json({ message: 'Error adding candidate', error: error.message });
         } else {
-            res.status(400).json({ message: 'Error adding candidate', error: 'Unknown error' });
+            res.status(400).json({ message: "", error: 'Unknown error' });
         }
     }

[NoCoverage] StringLiteral
src/presentation/controllers/candidateController.ts:13:78
         if (error instanceof Error) {
             res.status(400).json({ message: 'Error adding candidate', error: error.message });
         } else {
-            res.status(400).json({ message: 'Error adding candidate', error: 'Unknown error' });
+            res.status(400).json({ message: 'Error adding candidate', error: "" });
         }
     }

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:18:72
     }
 };
 
-export const getCandidateById = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(req.params.id);
-        if (isNaN(id)) {
-            return res.status(400).json({ error: 'Invalid ID format' });
-        }
-        const candidate = await findCandidateById(id);
-        if (!candidate) {
-            return res.status(404).json({ error: 'Candidate not found' });
-        }
-        res.json(candidate);
-    } catch (error) {
-        res.status(500).json({ error: 'Internal Server Error' });
-    }
-};
+export const getCandidateById = async (req: Request, res: Response) => {};
 
 export const updateCandidateStageController = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:19:9
 };
 
 export const getCandidateById = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(req.params.id);
-        if (isNaN(id)) {
-            return res.status(400).json({ error: 'Invalid ID format' });
-        }
-        const candidate = await findCandidateById(id);
-        if (!candidate) {
-            return res.status(404).json({ error: 'Candidate not found' });
-        }
-        res.json(candidate);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: 'Internal Server Error' });
     }

[NoCoverage] ConditionalExpression
src/presentation/controllers/candidateController.ts:21:13
 export const getCandidateById = async (req: Request, res: Response) => {
     try {
         const id = parseInt(req.params.id);
-        if (isNaN(id)) {
+        if (true) {
             return res.status(400).json({ error: 'Invalid ID format' });
         }

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:21:24
 export const getCandidateById = async (req: Request, res: Response) => {
     try {
         const id = parseInt(req.params.id);
-        if (isNaN(id)) {
-            return res.status(400).json({ error: 'Invalid ID format' });
-        }
+        if (isNaN(id)) {}
         const candidate = await findCandidateById(id);
         if (!candidate) {

[NoCoverage] ObjectLiteral
src/presentation/controllers/candidateController.ts:22:41
     try {
         const id = parseInt(req.params.id);
         if (isNaN(id)) {
-            return res.status(400).json({ error: 'Invalid ID format' });
+            return res.status(400).json({});
         }
         const candidate = await findCandidateById(id);

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:25:25
             return res.status(400).json({ error: 'Invalid ID format' });
         }
         const candidate = await findCandidateById(id);
-        if (!candidate) {
-            return res.status(404).json({ error: 'Candidate not found' });
-        }
+        if (!candidate) {}
         res.json(candidate);
     } catch (error) {

[NoCoverage] ConditionalExpression
src/presentation/controllers/candidateController.ts:25:13
             return res.status(400).json({ error: 'Invalid ID format' });
         }
         const candidate = await findCandidateById(id);
-        if (!candidate) {
+        if (true) {
             return res.status(404).json({ error: 'Candidate not found' });
         }

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:29:21
             return res.status(404).json({ error: 'Candidate not found' });
         }
         res.json(candidate);
-    } catch (error) {
-        res.status(500).json({ error: 'Internal Server Error' });
-    }
+    } catch (error) {}
 };
 

[NoCoverage] ObjectLiteral
src/presentation/controllers/candidateController.ts:30:30
         }
         res.json(candidate);
     } catch (error) {
-        res.status(500).json({ error: 'Internal Server Error' });
+        res.status(500).json({});
     }
 };

[Killed] BlockStatement
src/presentation/controllers/candidateController.ts:35:9
 };
 
 export const updateCandidateStageController = async (req: Request, res: Response) => {
-    try {
-        const id = parseInt(req.params.id);
-        const { applicationId, currentInterviewStep } = req.body;
-        const applicationIdNumber = parseInt(applicationId);
-        if (isNaN(applicationIdNumber)) {
-            return res.status(400).json({ error: 'Invalid position ID format' });
-        }
-        const currentInterviewStepNumber = parseInt(currentInterviewStep);
-        if (isNaN(currentInterviewStepNumber)) {
-            return res.status(400).json({ error: 'Invalid currentInterviewStep format' });
-        }
-        const updatedCandidate = await updateCandidateStage(id, applicationIdNumber, currentInterviewStepNumber);
-        res.status(200).json({ message: 'Candidate stage updated successfully', data: updatedCandidate });
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
         if (error instanceof Error) {
             if (error.message === 'Error: Application not found') {
killedBy: updateCandidateStageController should return 200 and updated candidate stage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
src/presentation/controllers/candidateController.ts:39:13
         const id = parseInt(req.params.id);
         const { applicationId, currentInterviewStep } = req.body;
         const applicationIdNumber = parseInt(applicationId);
-        if (isNaN(applicationIdNumber)) {
+        if (true) {
             return res.status(400).json({ error: 'Invalid position ID format' });
         }
killedBy: updateCandidateStageController should return 200 and updated candidate stage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] ConditionalExpression
src/presentation/controllers/candidateController.ts:39:13
         const id = parseInt(req.params.id);
         const { applicationId, currentInterviewStep } = req.body;
         const applicationIdNumber = parseInt(applicationId);
-        if (isNaN(applicationIdNumber)) {
+        if (false) {
             return res.status(400).json({ error: 'Invalid position ID format' });
         }

[Killed] ConditionalExpression
src/presentation/controllers/candidateController.ts:43:13
             return res.status(400).json({ error: 'Invalid position ID format' });
         }
         const currentInterviewStepNumber = parseInt(currentInterviewStep);
-        if (isNaN(currentInterviewStepNumber)) {
+        if (true) {
             return res.status(400).json({ error: 'Invalid currentInterviewStep format' });
         }
killedBy: updateCandidateStageController should return 200 and updated candidate stage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] ConditionalExpression
src/presentation/controllers/candidateController.ts:43:13
             return res.status(400).json({ error: 'Invalid position ID format' });
         }
         const currentInterviewStepNumber = parseInt(currentInterviewStep);
-        if (isNaN(currentInterviewStepNumber)) {
+        if (false) {
             return res.status(400).json({ error: 'Invalid currentInterviewStep format' });
         }

[Killed] ObjectLiteral
src/presentation/controllers/candidateController.ts:47:30
             return res.status(400).json({ error: 'Invalid currentInterviewStep format' });
         }
         const updatedCandidate = await updateCandidateStage(id, applicationIdNumber, currentInterviewStepNumber);
-        res.status(200).json({ message: 'Candidate stage updated successfully', data: updatedCandidate });
+        res.status(200).json({});
     } catch (error: unknown) {
         if (error instanceof Error) {
killedBy: updateCandidateStageController should return 200 and updated candidate stage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": Object {
-     "applicationId": 1,

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:48:30
         }
         const updatedCandidate = await updateCandidateStage(id, applicationIdNumber, currentInterviewStepNumber);
         res.status(200).json({ message: 'Candidate stage updated successfully', data: updatedCandidate });
-    } catch (error: unknown) {
-        if (error instanceof Error) {
-            if (error.message === 'Error: Application not found') {
-                res.status(404).json({ message: 'Application not found', error: error.message });
-            } else {
-                res.status(400).json({ message: 'Error updating candidate stage', error: error.message });
-            }
-        } else {
-            res.status(500).json({ message: 'Error updating candidate stage', error: 'Unknown error' });
-        }
-    }
+    } catch (error: unknown) {}
 };
 export { addCandidate };

[NoCoverage] ConditionalExpression
src/presentation/controllers/candidateController.ts:49:13
         const updatedCandidate = await updateCandidateStage(id, applicationIdNumber, currentInterviewStepNumber);
         res.status(200).json({ message: 'Candidate stage updated successfully', data: updatedCandidate });
     } catch (error: unknown) {
-        if (error instanceof Error) {
+        if (true) {
             if (error.message === 'Error: Application not found') {
                 res.status(404).json({ message: 'Application not found', error: error.message });

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:50:67
         res.status(200).json({ message: 'Candidate stage updated successfully', data: updatedCandidate });
     } catch (error: unknown) {
         if (error instanceof Error) {
-            if (error.message === 'Error: Application not found') {
-                res.status(404).json({ message: 'Application not found', error: error.message });
-            } else {
+            if (error.message === 'Error: Application not found') {} else {
                 res.status(400).json({ message: 'Error updating candidate stage', error: error.message });
             }

[NoCoverage] EqualityOperator
src/presentation/controllers/candidateController.ts:50:17
         res.status(200).json({ message: 'Candidate stage updated successfully', data: updatedCandidate });
     } catch (error: unknown) {
         if (error instanceof Error) {
-            if (error.message === 'Error: Application not found') {
+            if (error.message !== 'Error: Application not found') {
                 res.status(404).json({ message: 'Application not found', error: error.message });
             } else {

[NoCoverage] ObjectLiteral
src/presentation/controllers/candidateController.ts:51:38
     } catch (error: unknown) {
         if (error instanceof Error) {
             if (error.message === 'Error: Application not found') {
-                res.status(404).json({ message: 'Application not found', error: error.message });
+                res.status(404).json({});
             } else {
                 res.status(400).json({ message: 'Error updating candidate stage', error: error.message });

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:52:20
         if (error instanceof Error) {
             if (error.message === 'Error: Application not found') {
                 res.status(404).json({ message: 'Application not found', error: error.message });
-            } else {
-                res.status(400).json({ message: 'Error updating candidate stage', error: error.message });
-            }
+            } else {}
         } else {
             res.status(500).json({ message: 'Error updating candidate stage', error: 'Unknown error' });

[NoCoverage] StringLiteral
src/presentation/controllers/candidateController.ts:53:49
             if (error.message === 'Error: Application not found') {
                 res.status(404).json({ message: 'Application not found', error: error.message });
             } else {
-                res.status(400).json({ message: 'Error updating candidate stage', error: error.message });
+                res.status(400).json({ message: "", error: error.message });
             }
         } else {

[NoCoverage] ObjectLiteral
src/presentation/controllers/candidateController.ts:53:38
             if (error.message === 'Error: Application not found') {
                 res.status(404).json({ message: 'Application not found', error: error.message });
             } else {
-                res.status(400).json({ message: 'Error updating candidate stage', error: error.message });
+                res.status(400).json({});
             }
         } else {

[NoCoverage] BlockStatement
src/presentation/controllers/candidateController.ts:55:16
             } else {
                 res.status(400).json({ message: 'Error updating candidate stage', error: error.message });
             }
-        } else {
-            res.status(500).json({ message: 'Error updating candidate stage', error: 'Unknown error' });
-        }
+        } else {}
     }
 };

[NoCoverage] StringLiteral
src/presentation/controllers/candidateController.ts:56:45
                 res.status(400).json({ message: 'Error updating candidate stage', error: error.message });
             }
         } else {
-            res.status(500).json({ message: 'Error updating candidate stage', error: 'Unknown error' });
+            res.status(500).json({ message: "", error: 'Unknown error' });
         }
     }
