[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:5:71
 import { getCandidatesByPositionService, getInterviewFlowByPositionService, getAllPositionsService } from '../../application/services/positionService';
 
 
-export const getAllPositions = async (req: Request, res: Response) => {
-    try {
-        const positions = await getAllPositionsService();
-        res.status(200).json(positions);
-    } catch (error) {
-        res.status(500).json({ message: 'Error retrieving positions', error: error instanceof Error ? error.message : String(error) });
-    }
-};
+export const getAllPositions = async (req: Request, res: Response) => {};
 
 export const getCandidatesByPosition = async (req: Request, res: Response) => {

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:6:9
 
 
 export const getAllPositions = async (req: Request, res: Response) => {
-    try {
-        const positions = await getAllPositionsService();
-        res.status(200).json(positions);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ message: 'Error retrieving positions', error: error instanceof Error ? error.message : String(error) });
     }

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:9:21
     try {
         const positions = await getAllPositionsService();
         res.status(200).json(positions);
-    } catch (error) {
-        res.status(500).json({ message: 'Error retrieving positions', error: error instanceof Error ? error.message : String(error) });
-    }
+    } catch (error) {}
 };
 

[Killed] BlockStatement
src/presentation/controllers/positionController.ts:14:79
     }
 };
 
-export const getCandidatesByPosition = async (req: Request, res: Response) => {
-    try {
-        const positionId = parseInt(req.params.id);
-        const candidates = await getCandidatesByPositionService(positionId);
-        res.status(200).json(candidates);
-    } catch (error) {
-        if (error instanceof Error) {
-            res.status(500).json({ message: 'Error retrieving candidates', error: error.message });
-        } else {
-            res.status(500).json({ message: 'Error retrieving candidates', error: String(error) });
-        }
-    }
-};
+export const getCandidatesByPosition = async (req: Request, res: Response) => {};
 
 export const getInterviewFlowByPosition = async (req: Request, res: Response) => {
killedBy: getCandidatesByPosition should return 200 and candidates data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
src/presentation/controllers/positionController.ts:15:9
 };
 
 export const getCandidatesByPosition = async (req: Request, res: Response) => {
-    try {
-        const positionId = parseInt(req.params.id);
-        const candidates = await getCandidatesByPositionService(positionId);
-        res.status(200).json(candidates);
-    } catch (error) {
+    try {} catch (error) {
         if (error instanceof Error) {
             res.status(500).json({ message: 'Error retrieving candidates', error: error.message });
killedBy: getCandidatesByPosition should return 200 and candidates data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:19:21
         const positionId = parseInt(req.params.id);
         const candidates = await getCandidatesByPositionService(positionId);
         res.status(200).json(candidates);
-    } catch (error) {
-        if (error instanceof Error) {
-            res.status(500).json({ message: 'Error retrieving candidates', error: error.message });
-        } else {
-            res.status(500).json({ message: 'Error retrieving candidates', error: String(error) });
-        }
-    }
+    } catch (error) {}
 };
 

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:20:37
         const candidates = await getCandidatesByPositionService(positionId);
         res.status(200).json(candidates);
     } catch (error) {
-        if (error instanceof Error) {
-            res.status(500).json({ message: 'Error retrieving candidates', error: error.message });
-        } else {
+        if (error instanceof Error) {} else {
             res.status(500).json({ message: 'Error retrieving candidates', error: String(error) });
         }

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:22:16
     } catch (error) {
         if (error instanceof Error) {
             res.status(500).json({ message: 'Error retrieving candidates', error: error.message });
-        } else {
-            res.status(500).json({ message: 'Error retrieving candidates', error: String(error) });
-        }
+        } else {}
     }
 };

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:28:82
     }
 };
 
-export const getInterviewFlowByPosition = async (req: Request, res: Response) => {
-    try {
-        const positionId = parseInt(req.params.id);
-        const interviewFlow = await getInterviewFlowByPositionService(positionId);
-        res.status(200).json({ interviewFlow });
-    } catch (error) {
-        if (error instanceof Error) {
-            res.status(404).json({ message: 'Position not found', error: error.message });
-        } else {
-            res.status(500).json({ message: 'Server error', error: String(error) });
-        }
-    }
-};
+export const getInterviewFlowByPosition = async (req: Request, res: Response) => {};

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:29:9
 };
 
 export const getInterviewFlowByPosition = async (req: Request, res: Response) => {
-    try {
-        const positionId = parseInt(req.params.id);
-        const interviewFlow = await getInterviewFlowByPositionService(positionId);
-        res.status(200).json({ interviewFlow });
-    } catch (error) {
+    try {} catch (error) {
         if (error instanceof Error) {
             res.status(404).json({ message: 'Position not found', error: error.message });

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:33:21
         const positionId = parseInt(req.params.id);
         const interviewFlow = await getInterviewFlowByPositionService(positionId);
         res.status(200).json({ interviewFlow });
-    } catch (error) {
-        if (error instanceof Error) {
-            res.status(404).json({ message: 'Position not found', error: error.message });
-        } else {
-            res.status(500).json({ message: 'Server error', error: String(error) });
-        }
-    }
+    } catch (error) {}
 };

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:34:37
         const interviewFlow = await getInterviewFlowByPositionService(positionId);
         res.status(200).json({ interviewFlow });
     } catch (error) {
-        if (error instanceof Error) {
-            res.status(404).json({ message: 'Position not found', error: error.message });
-        } else {
+        if (error instanceof Error) {} else {
             res.status(500).json({ message: 'Server error', error: String(error) });
         }

[NoCoverage] BlockStatement
src/presentation/controllers/positionController.ts:36:16
     } catch (error) {
         if (error instanceof Error) {
             res.status(404).json({ message: 'Position not found', error: error.message });
-        } else {
-            res.status(500).json({ message: 'Server error', error: String(error) });
-        }
+        } else {}
     }
 };
