[NoCoverage] BlockStatement
src/routes/candidateRoutes.ts:6:38
 
 const router = Router();
 
-router.post('/', async (req, res) => {
-  try {
-    // console.log(req.body); //Just in case you want to inspect the request body
-    const result = await addCandidate(req.body);
-    res.status(201).send(result);
-  } catch (error) {
-    if (error instanceof Error) {
-      res.status(400).send({ message: error.message });
-    } else {
-      res.status(500).send({ message: "An unexpected error occurred" });
-    }
-  }
-});
+router.post('/', async (req, res) => {});
 
 router.get('/:id', getCandidateById);

[NoCoverage] BlockStatement
src/routes/candidateRoutes.ts:7:7
 const router = Router();
 
 router.post('/', async (req, res) => {
-  try {
-    // console.log(req.body); //Just in case you want to inspect the request body
-    const result = await addCandidate(req.body);
-    res.status(201).send(result);
-  } catch (error) {
+  try {} catch (error) {
     if (error instanceof Error) {
       res.status(400).send({ message: error.message });

[NoCoverage] BlockStatement
src/routes/candidateRoutes.ts:11:19
     // console.log(req.body); //Just in case you want to inspect the request body
     const result = await addCandidate(req.body);
     res.status(201).send(result);
-  } catch (error) {
-    if (error instanceof Error) {
-      res.status(400).send({ message: error.message });
-    } else {
-      res.status(500).send({ message: "An unexpected error occurred" });
-    }
-  }
+  } catch (error) {}
 });
 

[NoCoverage] BlockStatement
src/routes/candidateRoutes.ts:12:33
     const result = await addCandidate(req.body);
     res.status(201).send(result);
   } catch (error) {
-    if (error instanceof Error) {
-      res.status(400).send({ message: error.message });
-    } else {
+    if (error instanceof Error) {} else {
       res.status(500).send({ message: "An unexpected error occurred" });
     }

[NoCoverage] BlockStatement
src/routes/candidateRoutes.ts:14:12
   } catch (error) {
     if (error instanceof Error) {
       res.status(400).send({ message: error.message });
-    } else {
-      res.status(500).send({ message: "An unexpected error occurred" });
-    }
+    } else {}
   }
 });

[NoCoverage] StringLiteral
src/routes/candidateRoutes.ts:20:12
   }
 });
 
-router.get('/:id', getCandidateById);
+router.get("", getCandidateById);
 
 router.put('/:id', updateCandidateStageController);
