[NoCoverage] StringLiteral
src/routes/positionRoutes.ts:6:12
 
 const router = require('express').Router();
 
-router.get('/', getAllPositions);
+router.get("", getAllPositions);
 router.get('/:id/candidates', getCandidatesByPosition);
 router.get('/:id/interviewflow', getInterviewFlowByPosition);

[NoCoverage] StringLiteral
src/routes/positionRoutes.ts:8:12
 
 router.get('/', getAllPositions);
 router.get('/:id/candidates', getCandidatesByPosition);
-router.get('/:id/interviewflow', getInterviewFlowByPosition);
+router.get("", getInterviewFlowByPosition);
 
 export default router;
